Repository: ClusterLabs/pacemaker
Catalog: doc/Pacemaker_Explained/*/Ch-Advanced-Resources.po
Languages: ro_ro

source: Supporting notifications requires the <literal>notify</literal> action to be implemented. Once supported, the notify action will be passed a number of extra variables which, when combined with additional context, can be used to calculate the current state of the cluster and what is about to happen to it.
ro_ro: Suportarea notificărilor necesită acţiunea <literal>notify</literal> să fie implementată. Odată ce este suportată, acţiunii de notificare îi vor fi trimise un număr de variabile suplimentare care, atunci când sunt combinate cu un context adiţional, pot fi folosite pentru a calcula starea curentă a clusterului şi ceea ce urmează să i se întâmple.

source: Environment variables supplied with Clone notify actions
ro_ro: Variabile de mediu furnizate împreună cu acţiunile de notificare ale Clonei

source: Variable
ro_ro: Variabilă

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_type</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_type</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_type
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_type</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_type</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_type

source: Allowed values: <literal>pre</literal>, <literal>post</literal>
ro_ro: Valori permise: <literal>pre</literal>, <literal>post</literal>

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_operation</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_operation</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_operation
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_operation</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_operation</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_operation

source: Allowed values: <literal>start</literal>, <literal>stop</literal>
ro_ro: Valori permise: <literal>start</literal>, <literal>stop</literal>

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_start_resource</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_start_resource</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_start_resource
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_start_resource</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_start_resource</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_start_resource

source: Resources to be started
ro_ro: Resursele care vor fi pornite

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_stop_resource</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_stop_resource</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_stop_resource
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_stop_resource</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_stop_resource</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_stop_resource

source: Resources to be stopped
ro_ro: Resursele care vor fi oprite

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_active_resource</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_active_resource</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_active_resource
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_active_resource</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_active_resource</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_active_resource

source: Resources that are running
ro_ro: Resursele care rulează

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_inactive_resource</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_inactive_resource</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_inactive_resource
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_inactive_resource</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_inactive_resource</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_inactive_resource

source: Resources that are not running
ro_ro: Resursele care nu rulează

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_start_uname</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_start_uname</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_start_uname
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_start_uname</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_start_uname</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_start_uname

source: Nodes on which resources will be started
ro_ro: Nodurile pe care resursele vor fi pornite

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_stop_uname</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_stop_uname</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_stop_uname
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_stop_uname</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_stop_uname</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_stop_uname

source: Nodes on which resources will be stopped
ro_ro: Nodurile pe care resursele vor fi oprite

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_active_uname</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_active_uname</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_active_uname
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_active_uname</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_active_uname</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_active_uname

source: Nodes on which resources are running
ro_ro: Nodurile pe care rulează resursele

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_inactive_uname</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_inactive_uname</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_inactive_uname
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>meta_notify_inactive_uname</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_inactive_uname</secondary></indexterm> OCF_RESKEY_CRM_meta_notify_inactive_uname

source: Nodes on which resources are not running
ro_ro: Nodurile pe care nu rulează resursele

source: The variables come in pairs, such as <envar>OCF_RESKEY_CRM_meta_notify_start_resource</envar> and <envar>OCF_RESKEY_CRM_meta_notify_start_uname</envar> and should be treated as an array of whitespace separated elements.
ro_ro: Variabilele vin în perechi, cum ar fi <envar>OCF_RESKEY_CRM_meta_notify_start_resource</envar> şi <envar>OCF_RESKEY_CRM_meta_notify_start_uname</envar> şi ar trebui tratate ca un array de elemente separate de spaţiu.

source: Thus in order to indicate that <literal>clone:0</literal> will be started on <literal>sles-1</literal>, <literal>clone:2</literal> will be started on <literal>sles-3</literal>, and <literal>clone:3</literal> will be started on <literal>sles-2</literal>, the cluster would set
ro_ro: Drept urmare pentru a indica faptul că, <literal>clone:0</literal> va fi pornită pe <literal>sles-1</literal>, <literal>clone:2</literal> va fi pornită pe <literal>sles-3</literal> şi <literal>clone:3</literal> va fi pornită pe <literal>sles-2</literal>, clusterul va seta

source: Example notification variables
ro_ro: Exemple de variabile de notificare

source: Proper Interpretation of Notification Environment Variables
ro_ro: Interpretarea Corespunzătoare a Variabilelor de Mediu de Notificare

source: Pre-notification (stop):
ro_ro: Pre-notificare (oprire)

source: Active resources: <envar>$OCF_RESKEY_CRM_meta_notify_active_resource</envar>
ro_ro: Resurse active: <envar>$OCF_RESKEY_CRM_meta_notify_active_resource</envar>

source: Inactive resources: <envar>$OCF_RESKEY_CRM_meta_notify_inactive_resource</envar>
ro_ro: Resurse inactive: <envar>$OCF_RESKEY_CRM_meta_notify_inactive_resource</envar>

source: Resources to be started: <envar>$OCF_RESKEY_CRM_meta_notify_start_resource</envar>
ro_ro: Resurse care vor fi pornite: <envar>$OCF_RESKEY_CRM_meta_notify_start_resource</envar>

source: Resources to be stopped: <envar>$OCF_RESKEY_CRM_meta_notify_stop_resource</envar>
ro_ro: Resurse care vor fi oprite: <envar>$OCF_RESKEY_CRM_meta_notify_stop_resource</envar>

source: Post-notification (stop) / Pre-notification (start):
ro_ro: Post-notificare (oprire) / Pre-notificare (pornire)

source: Active resources
ro_ro: Resurse active:

source: Inactive resources
ro_ro: Resurse inactive:

source: Resources that were started: <envar>$OCF_RESKEY_CRM_meta_notify_start_resource</envar>
ro_ro: Resurse care au fost pornite: <envar>$OCF_RESKEY_CRM_meta_notify_start_resource</envar>

source: Resources that were stopped: <envar>$OCF_RESKEY_CRM_meta_notify_stop_resource</envar>
ro_ro: Resurse care au fost oprite: <envar>$OCF_RESKEY_CRM_meta_notify_stop_resource</envar>

source: Post-notification (start):
ro_ro: Post-notificare (pornire)

source: Active resources:
ro_ro: Resurse active:

source: Inactive resources:
ro_ro: Resurse inactive:

source: <indexterm significance="preferred"><primary>Multi-state Resources</primary></indexterm> <indexterm significance="preferred"><primary>Resources</primary><secondary>Multi-state</secondary></indexterm> Multi-state - Resources That Have Multiple Modes
ro_ro: <indexterm significance="preferred"><primary>Resurse Multi-state</primary></indexterm> <indexterm significance="preferred"><primary>Resurse</primary><secondary>Multi-state</secondary></indexterm> Multi-state - Resurse Care Au Moduri Multiple

source: Multi-state resources are a specialization of Clone resources; please ensure you understand the section on clones before continuing! They allow the instances to be in one of two operating modes; these are called <literal>Master</literal> and <literal>Slave</literal>, but can mean whatever you wish them to mean. The only limitation is that when an instance is started, it must come up in the <literal>Slave</literal> state.
ro_ro: Resursele multi-state sunt o specializare a Clonelor (vă rugăm să vă asiguraţi că înţelegeţi secţiunea referitoare la clone înainte de a continua) care permite instanţelor să se afle în unul din două moduri operaţionale; aceste moduri sunt numite <literal>Master</literal> şi <literal>Slave</literal> dar pot însemna orice doriţi să însemne. Singura limitare este că atunci când o instanţă este pornită, trebuie să o facă în starea <literal>Slave</literal>.

source: Properties of a Multi-State Resource
ro_ro: Proprietăţile unei Resurse Multi-State

source: <indexterm significance="preferred"><primary>id</primary><secondary>Multi-State Resource Property</secondary></indexterm> <indexterm><primary>Multi-State Resource Properties</primary><secondary>id</secondary></indexterm> <indexterm><primary>Resource</primary><secondary>Multi-State Property</secondary><tertiary>id</tertiary></indexterm> id
ro_ro: <indexterm significance="preferred"><primary>id</primary><secondary>Proprietatea Resursei Multi-State</secondary></indexterm> <indexterm><primary>Proprietățile Resursei Multi-State</primary><secondary>id</secondary></indexterm> <indexterm><primary>Resursă</primary><secondary>Proprietatea Multi-State</secondary><tertiary>id</tertiary></indexterm> id

source: Your name for the multi-state resource
ro_ro: Numele asignat pentru resursa multi-state

source: Options inherited from <link linkend="s-resource-supported">simple resources</link>: <literal>priority</literal>, <literal>target-role</literal>, <literal>is-managed</literal>
ro_ro: Opţiunile moştenite de la <link linkend="s-resource-supported">resurse simple</link>: <literal>priority</literal>, <literal>target-role</literal>, <literal>is-managed</literal>

source: Options inherited from <link linkend="s-resource-clone">clone resources</link>: <literal>clone-max</literal>, <literal>clone-node-max</literal>, <literal>notify</literal>, <literal>globally-unique</literal>, <literal>ordered</literal>, <literal>interleave</literal>
ro_ro: Opţiuni moştenite de la <link linkend="s-resource-clone">resursele clonate</link>: <literal>clone-max</literal>, <literal>clone-node-max</literal>, <literal>notify</literal>, <literal>globally-unique</literal>, <literal>ordered</literal>, <literal>interleave</literal>

source: Multi-state specific resource configuration options
ro_ro: Opţiuni specifice de configurare pentru resurse multi-state

source: <indexterm significance="preferred"><primary>master-max Multi-State Resource Property</primary></indexterm> <indexterm><primary>Multi-State Resource Properties</primary><secondary>master-max</secondary></indexterm> <indexterm><primary>Resource</primary><secondary>Multi-State Property</secondary><tertiary>master-max</tertiary></indexterm> master-max
ro_ro: <indexterm significance="preferred"><primary>master-max Proprietatea Resursei Multi-State</primary></indexterm> <indexterm><primary>Proprietățile Resursei Multi-State</primary><secondary>master-max</secondary></indexterm> <indexterm><primary>Resursă</primary><secondary>Proprietatea Multi-State</secondary><tertiary>master-max</tertiary></indexterm> master-max

source: How many copies of the resource can be promoted to <literal>master</literal> status; default 1.
ro_ro: Câte copii ale resursei pot fi promovate la statutul de <literal>master</literal>; valoarea implicită este 1.

source: <indexterm significance="preferred"><primary>master-node-max Multi-State Resource Property</primary></indexterm> <indexterm><primary>Multi-State Resource Properties</primary><secondary>master-node-max</secondary></indexterm> <indexterm><primary>Resource</primary><secondary>Multi-State Property</secondary><tertiary>master-node-max</tertiary></indexterm> master-node-max
ro_ro: <indexterm significance="preferred"><primary>master-node-max Proprietatea Resursei Multi-State</primary></indexterm> <indexterm><primary>Proprietățile Resursei Multi-State</primary><secondary>master-node-max</secondary></indexterm> <indexterm><primary>Resursă</primary><secondary>Proprietatea Multi-State</secondary><tertiary>master-node-max</tertiary></indexterm> master-node-max

source: How many copies of the resource can be promoted to <literal>master</literal> status on a single node; default 1.
ro_ro: Câte copii ale resursei pot fi promovate la statutul de <literal>master</literal> pe un singur nod; valoarea implicită este 1.

source: Multi-state resources have no instance attributes; however, any that are set here will be inherited by master's children.
ro_ro: Resursele multi-state nu au atribute de instanţă; însă, oricare ar fi setate aici vor fi moştenite de către copiii master-ului.

source: Masters must contain exactly one group or one regular resource.
ro_ro: Masterii trebuie să conţină exact un grup sau o resursă obişnuită.

source: You should never reference the name of a master's child. If you think you need to do this, you probably need to re-evaluate your design.
ro_ro: Nu ar trebui să referenţiaţi niciodată numele copilului unui master. Dacă credeți că trebuie sa faceți asta, atunci probabil trebuie să re-evaluați designul vostru.

source: Monitoring Multi-State Resources
ro_ro: Monitorizarea Resurselor Multi-State

source: The normal type of monitor actions are not sufficient to monitor a multi-state resource in the <literal>Master</literal> state. To detect failures of the <literal>Master</literal> instance, you need to define an additional monitor action with <literal>role="Master"</literal>.
ro_ro: Tipul normal de acţiuni de monitorizare nu sunt suficiente pentru a monitoriza o resursă multi-state în starea <literal>Master</literal>. Pentru a detecta eşecurile instanţei <literal>Master</literal>, trebuie să definiţi o acţiune de monitorizare adiţională cu <literal>role="Master"</literal>.

source: It is crucial that <emphasis>every</emphasis> monitor operation has a different interval!
ro_ro: Este imperativ ca <emphasis>fiecare</emphasis> operaţiune de monitorizare să aibă un interval diferit!

source: This is because Pacemaker currently differentiates between operations only by resource and interval; so if eg. a master/slave resource has the same monitor interval for both roles, Pacemaker would ignore the role when checking the status - which would cause unexpected return codes, and therefore unnecessary complications.
ro_ro: Acest lucru este necesar deoarece Pacemaker diferențiază în mod curent între operațiuni numai după resursă și interval; deci dacă de ex. o resursă master/slave are același interval de monitorizare pentru ambele roluri, Pacemaker ar ignora rolul când ar verifica statusul - fapt care ar cauza coduri de ieșire neașteptate și respectiv complicații inutile.

source: Monitoring both states of a multi-state resource
ro_ro: Monitorizarea ambelor stări ale unei resurse multi-state

source: In most cases, a multi-state resources will have a single copy on each active cluster node. If this is not the case, you can indicate which nodes the cluster should preferentially assign copies to with resource location constraints. These constraints are written no differently to those for regular resources except that the master's id is used.
ro_ro: În majoritatea cazurilor, o resursă multi-state va avea o singură copie pe fiecare nod activ din cluster. Dacă nu este cazul însă, puteţi indica pe care noduri ar trebui clusterul în mod preferențial să asigneze copii cu restricţii de locaţie ale resurselor. Aceste restricţii nu sunt scrise diferit faţă de cele pentru resursele obişnuite cu excepţia faptului că id-ul masterului este folosit.

source: When considering multi-state resources in constraints, for most purposes it is sufficient to treat them as clones. The exception is when the <literal>rsc-role</literal> and/or <literal>with-rsc-role</literal> fields (for colocation constraints) and <literal>first-action</literal> and/or <literal>then-action</literal> fields (for ordering constraints) are used.
ro_ro: Când ţinem cont de resursele multi-state în restricţii, pentru majoritatea scopurilor este suficient să le tratăm ca pe clone. Excepţia survine atunci când sunt folosite câmpurile <literal>rsc-role</literal> şi/sau <literal>with-rsc-role</literal> (pentru restricţii de colocare) şi câmpurile <literal>first-action</literal> şi/sau <literal>then-action</literal> (pentru restricţii de ordonare).

source: Additional constraint options relevant to multi-state resources
ro_ro: Opţiuni de restricţionare adiţionale relevante la resurse multi-state

source: <indexterm significance="preferred"><primary>rsc-role Multi-State Resource Constraints</primary></indexterm> <indexterm><primary>Multi-State Resource Constraints</primary><secondary>rsc-role</secondary></indexterm> <indexterm><primary>Resource</primary><secondary>Multi-State Constraints</secondary><tertiary>rsc-role</tertiary></indexterm> rsc-role
ro_ro: <indexterm significance="preferred"><primary>rsc-role Restricții Resursă Multi-State</primary></indexterm> <indexterm><primary>Restricții Resursă Multi-State</primary><secondary>rsc-role</secondary></indexterm> <indexterm><primary>Resursă</primary><secondary>Restricții Multi-State</secondary><tertiary>rsc-role</tertiary></indexterm> rsc-role

source: An additional attribute of colocation constraints that specifies the role that <literal>rsc</literal> must be in. Allowed values: <emphasis>Started</emphasis>, <literal>Master</literal>, <literal>Slave</literal>.
ro_ro: Un atribut adiţional al restricţiilor de colocare care specifică rolul în care trebuie să se alfe <literal>rsc</literal>. Valori permise: <emphasis>Started</emphasis>, <literal>Master</literal>, <literal>Slave</literal>.

source: <indexterm significance="preferred"><primary>with-rsc-role Multi-State Resource Constraints</primary></indexterm> <indexterm><primary>Multi-State Resource Constraints</primary><secondary>with-rsc-role</secondary></indexterm> <indexterm><primary>Resource</primary><secondary>Multi-State Constraints</secondary><tertiary>with-rsc-role</tertiary></indexterm> with-rsc-role
ro_ro: <indexterm significance="preferred"><primary>with-rsc-role Restricții Resursă Multi-State</primary></indexterm> <indexterm><primary>Restricții Resursă Multi-State</primary><secondary>with-rsc-role</secondary></indexterm> <indexterm><primary>Resursă</primary><secondary>Restricții Multi-State</secondary><tertiary>with-rsc-role</tertiary></indexterm> with-rsc-role

source: An additional attribute of colocation constraints that specifies the role that <literal>with-rsc</literal> must be in. Allowed values: <emphasis>Started</emphasis>, <literal>Master</literal>, <literal>Slave</literal>.
ro_ro: Un atribut adiţional al restricţiilor de colocare care specifică rolul în care trebuie să se alfe <literal>with-rsc</literal>. Valori permise: <emphasis>Started</emphasis>, <literal>Master</literal>, <literal>Slave</literal>.

source: <indexterm significance="preferred"><primary>first-action Multi-State Resource Constraints</primary></indexterm> <indexterm><primary>Multi-State Resource Constraints</primary><secondary>first-action</secondary></indexterm> <indexterm><primary>Resource</primary><secondary>Multi-State Constraints</secondary><tertiary>first-action</tertiary></indexterm> first-action
ro_ro: <indexterm significance="preferred"><primary>first-action Restricții Resursă Multi-State</primary></indexterm> <indexterm><primary>Restricții Resursă Multi-State</primary><secondary>first-action</secondary></indexterm> <indexterm><primary>Resursă</primary><secondary>Restricții Multi-State</secondary><tertiary>first-action</tertiary></indexterm> first-action

source: An additional attribute of ordering constraints that specifies the action that the <literal>first</literal> resource must complete before executing the specified action for the <literal>then</literal> resource. Allowed values: <emphasis>start</emphasis>, <literal>stop</literal>, <literal>promote</literal>, <literal>demote</literal>.
ro_ro: Un atribut adiţional al restricţiilor de ordonare care specifică acţiunea pe care resursa <literal>first</literal> trebuie să o termine înaintea executării acţiunii specificate pentru resursa <literal>then</literal>. Valori permise: <emphasis>start</emphasis>, <literal>stop</literal>, <literal>promote</literal>, <literal>demote</literal>.
