Repository: ClusterLabs/pacemaker
Catalog: doc/Pacemaker_Explained/*/Ch-Advanced-Resources.po
Languages: ro_ro

source: Advanced Resource Types
ro_ro: Tipuri Avansate de Resurse

source: <indexterm significance="preferred"><primary>Group Resources</primary></indexterm> <indexterm><primary>Resources</primary><secondary>Groups</secondary></indexterm> Groups - A Syntactic Shortcut
ro_ro: <indexterm significance="preferred"><primary>Grup de Resurse</primary></indexterm> <indexterm><primary>Resurse</primary><secondary>Grupuri</secondary></indexterm> Grupuri - A Scurtătură Sintactică

source: One of the most common elements of a cluster is a set of resources that need to be located together, start sequentially, and stop in the reverse order. To simplify this configuration we support the concept of groups.
ro_ro: Unul dintre cele mai comune elemente ale unui cluster este un set de resurse care trebuie plasate împreună, pornesc secvenţial şi se opres în ordine inversă. Pentru a simplifica această configuraţie suportăm conceptul de grupuri.

source: An example group
ro_ro: Un exemplu de grup

source: Although the example above contains only two resources, there is no limit to the number of resources a group can contain. The example is also sufficient to explain the fundamental properties of a group:
ro_ro: Deşi exemplul de mai sus conţine doar două resurse, nu este nici o limită asupra numărului de resurse pe care le poate conţine un grup. Exemplul este de asemenea suficient pentru a explica proprietăţile fundamentale ale unui grup:

source: Resources are started in the order they appear in (<literal>Public-IP</literal> first, then <literal>Email</literal>)
ro_ro: Resursele sunt pornite în ordinea în care apar (întâi <literal>Public-IP</literal>, apoi <literal>Email</literal>)

source: Resources are stopped in the reverse order to which they appear in (<literal>Email</literal> first, then <literal>Public-IP</literal>)
ro_ro: Resursele sunt oprite în ordine inversă faţă de cea în care apar (întâi <literal>Email</literal>, apoi <literal>Public-IP</literal>)

source: If a resource in the group can't run anywhere, then nothing after that is allowed to run, too.
ro_ro: Dacă o resursă din grup nu poate rula nicăieri, atunci nimic din ce urmează după aceasta nu îi este permis să ruleze

source: If <literal>Public-IP</literal> can't run anywhere, neither can <literal>Email</literal>;
ro_ro: Dacă <literal>Public-IP</literal> nu poate rula nicăieri, nici <literal>Email</literal> nu va putea;

source: but if <literal>Email</literal> can't run anywhere, this does not affect <literal>Public-IP</literal> in any way
ro_ro: dar dacă <literal>Email</literal> nu poate rula nicăieri, acest lucru nu afectează <literal>Public-IP</literal> în nici un fel

source: The group above is logically equivalent to writing:
ro_ro: Grupul de deasupra este echivalent logic cu a scrie:

source: How the cluster sees a group resource
ro_ro: Cum vede clusterul un grup de resurse

source: Obviously as the group grows bigger, the reduced configuration effort can become significant.
ro_ro: În mod evident pe măsură ce grupul creşte, efortul de configurare redus poate deveni semnificativ.

source: Another (typical) example of a group is a DRBD volume, the filesystem mount, an IP address, and an application that uses them.
ro_ro: Un alt exemplu (tipi) al unui grup este un volum DBRD, un mount de sistem de fișiere, o adresă IP și o aplicație care le folosește.

source: Properties
ro_ro: Proprietăţi

source: Properties of a Group Resource
ro_ro: Proprietăţile unui Grup de Resurse

source: Field
ro_ro: Câmp

source: Description
ro_ro: Descriere

source: <indexterm significance="preferred"><primary>id</primary><secondary>Group Resource Property</secondary></indexterm> <indexterm><primary>Group Resource Properties</primary><secondary>id</secondary></indexterm> <indexterm><primary>Resource</primary><secondary>Group Property</secondary><tertiary>id</tertiary></indexterm> id
ro_ro: <indexterm significance="preferred"><primary>id</primary><secondary>Proprietatea unei Resurse de Grup</secondary></indexterm> <indexterm><primary>Proprietățile unei Resurse de Grup</primary><secondary>id</secondary></indexterm> <indexterm><primary>Resursă</primary><secondary>Proprietate de Grup</secondary><tertiary>id</tertiary></indexterm> id

source: Your name for the group
ro_ro: Numele pe care îl daţi grupului

source: Options
ro_ro: Opţiuni

source: Options inherited from <link linkend="s-resource-options">simple resources</link>: <literal>priority, target-role, is-managed</literal>
ro_ro: Opţiuni moştenite de la <link linkend="s-resource-options">resurse simple</link>: <literal>priority, target-role, is-managed</literal>

source: Instance Attributes
ro_ro: Atributele Instanţelor

source: Groups have no instance attributes, however any that are set here will be inherited by the group's children.
ro_ro: Grupurile nu au atribute de instanţă, totuşi oricare ar fi setate aici vor fi moştenite de către copiii grupului.

source: Contents
ro_ro: Conţinut

source: Groups may only contain a collection of <link linkend="s-resource-supported">primitive</link> cluster resources. To refer to the child of a group resource, just use the child's id instead of the group's.
ro_ro: Grupurile pot conţine numai o colecţie de resurse de cluster de tip <link linkend="s-resource-supported">primitive</link>. Pentru a face referinţă la copilul unei resurse dintr-un grup, folosiţi pur şi simplu id-ul copilului în locul celui al grupului.

source: Constraints
ro_ro: Restricţii

source: Although it is possible to reference the group's children in constraints, it is usually preferable to use the group's name instead.
ro_ro: Deşi este posibil să referenţiezi copiii grupului în restricţii, este în mod uzual preferabil să folosiţi numele grupului în schimb.

source: Example constraints involving groups
ro_ro: Exemple de restricţii care implică grupuri

source: <indexterm><primary>resource-stickiness</primary><secondary>of a Group Resource</secondary></indexterm> Stickiness
ro_ro: <indexterm><primary>resource-stickiness</primary><secondary>a unei Resurse de Grup</secondary></indexterm> Adezivitatea

source: Stickiness, the measure of how much a resource wants to stay where it is, is additive in groups. Every active resource of the group will contribute its stickiness value to the group's total. So if the default <literal>resource-stickiness</literal> is 100, and a group has seven members, five of which are active, then the group as a whole will prefer its current location with a score of 500.
ro_ro: Adezivitatea, măsura a cât de mult vrea o resursă să rămână acolo unde este, este aditivă în grupuri. Fiecare membru activ al grupului va contribui cu valoarea adezivităţii acestuia la totalul grupului. Deci dacă valoarea implicită a <literal>resource-stickiness</literal> este 100 şi grupul are şapte membri, cinci din aceştia fiind activi, atunci grupul ca întreg va prefera locaţia curentă cu un scor de 500.

source: <indexterm significance="preferred"><primary>Clone Resources</primary></indexterm> <indexterm><primary>Resources</primary><secondary>Clones</secondary></indexterm> Clones - Resources That Get Active on Multiple Hosts
ro_ro: <indexterm significance="preferred"><primary>Resursele Clonă</primary></indexterm> <indexterm><primary>Resursele</primary><secondary>Clone</secondary></indexterm> Clonele - Resursele Care Devin Active pe mai Multe Gazde

source: Clones were initially conceived as a convenient way to start N instances of an IP resource and have them distributed throughout the cluster for load balancing. They have turned out to quite useful for a number of purposes including integrating with Red Hat's DLM, the fencing subsystem, and OCFS2.
ro_ro: Clonele au fost concepute iniţial ca o modalitate convenientă de a porni N instanţe ale unei resurse IP şi de a le avea distribuite de-a lungul clusterului pentru partajarea nivelului de încărcare. S-au dovedit a fi chiar utile pentru un număr de scopuri incluzând integrarea cu DLM-ul de la Red Hat, subsistemul de evacuare şi OCFS2.

source: You can clone any resource, provided the resource agent supports it.
ro_ro: Puteţi clona orice resursă atâta timp cât agentul de resursă suportă acest lucru.

source: Three types of cloned resources exist:
ro_ro: Există trei tipuri de resurse clonate.

source: Anonymous
ro_ro: Anonime

source: Globally Unique
ro_ro: Unice la nivel global

source: Anonymous clones are the simplest type. These resources behave completely identically everywhere they are running. Because of this, there can only be one copy of an anonymous clone active per machine.
ro_ro: Clonele anonime sunt tipul cel mai simplu. Aceste resurse se comportă absolut identic oriunde rulează. Din această cauză, poate exista doar o copie a unei clone anonime activă per maşină.

source: Globally unique clones are distinct entities. A copy of the clone running on one machine is not equivalent to another instance on another node. Nor would any two copies on the same node be equivalent.
ro_ro: Clonele unice la nivel global sunt entităţi distincte. O copie a unei clone rulând pe o maşină nu este echivalentă cu o altă instanţă pe alt nod. Nici nu ar fi echivalente oricare două copii pe acelaşi nod.

source: Stateful clones are covered later in <xref linkend="s-resource-multistate" />.
ro_ro: Clonele stateful sunt discutate mai târziu în <xref linkend="s-resource-multistate" />.

source: An example clone
ro_ro: Un exemplu de clonă

source: Properties of a Clone Resource
ro_ro: Proprietăţile unei Resurse Clonă

source: <indexterm significance="preferred"><primary>id</primary><secondary>Clone Resource Property</secondary></indexterm> <indexterm><primary>Clone Resource Properties</primary><secondary>id</secondary></indexterm> <indexterm><primary>Resource</primary><secondary>Clone Property</secondary><tertiary>id</tertiary></indexterm> id
ro_ro: <indexterm significance="preferred"><primary>id</primary><secondary>Proprietatea unei Resurse Clonă</secondary></indexterm> <indexterm><primary>Proprietățile Resurselor Clonă</primary><secondary>id</secondary></indexterm> <indexterm><primary>Resurse</primary><secondary>Proprietatea Clonei</secondary><tertiary>id</tertiary></indexterm> id

source: Your name for the clone
ro_ro: Numele dat clonei

source: Options inherited from <link linkend="s-resource-supported">simple resources</link>: <literal>priority, target-role, is-managed</literal>
ro_ro: Opţiunile moştenite de la <link linkend="s-resource-supported">resurse simple</link>: <literal>priority, target-role, is-managed</literal>

source: Clone specific configuration options
ro_ro: Opţiuni de configurare specifice clonei

source: <indexterm significance="preferred"><primary>clone-max Clone Resource Property</primary></indexterm> <indexterm><primary>Clone Resource Properties</primary><secondary>clone-max</secondary></indexterm> <indexterm><primary>Resource</primary><secondary>Clone Property</secondary><tertiary>clone-max</tertiary></indexterm> clone-max
ro_ro: <indexterm significance="preferred"><primary>clone-max Proprietatea unei Resurse Clonă</primary></indexterm> <indexterm><primary>Proprietățile Resursei Clonă</primary><secondary>clone-max</secondary></indexterm> <indexterm><primary>Resursă</primary><secondary>Proprietatea Clonei</secondary><tertiary>clone-max</tertiary></indexterm> clone-max

source: How many copies of the resource to start. Defaults to the number of nodes in the cluster.
ro_ro: Câte copii ale resursei să pornească. Valoarea implicită este egală cu numărul de noduri din cluster.

source: <indexterm significance="preferred"><primary>clone-node-max Clone Resource Property</primary></indexterm> <indexterm><primary>Clone Resource Properties</primary><secondary>clone-node-max</secondary></indexterm> <indexterm><primary>Resource</primary><secondary>Clone Property</secondary><tertiary>clone-node-max</tertiary></indexterm> clone-node-max
ro_ro: <indexterm significance="preferred"><primary>clone-node-max Proprietatea unei Resurse Clonă</primary></indexterm> <indexterm><primary>Proprietățile Resursei Clonă</primary><secondary>clone-node-max</secondary></indexterm> <indexterm><primary>Resursă</primary><secondary>Proprietatea Clonei</secondary><tertiary>clone-node-max</tertiary></indexterm> clone-node-max

source: How many copies of the resource can be started on a single node; default <emphasis>1</emphasis>.
ro_ro: Câte copii ale resursei pot fi pornite pe un singur nod; valoarea implicită este <emphasis>1</emphasis>.

source: <indexterm significance="preferred"><primary>notify Clone Resource Property</primary></indexterm> <indexterm><primary>Clone Resource Properties</primary><secondary>notify</secondary></indexterm> <indexterm><primary>Resource</primary><secondary>Clone Property</secondary><tertiary>notify</tertiary></indexterm> notify
ro_ro: <indexterm significance="preferred"><primary>notify Proprietatea unei Resurse Clonă</primary></indexterm> <indexterm><primary>Proprietățile Resursei Clonă</primary><secondary>notify</secondary></indexterm> <indexterm><primary>Resursă</primary><secondary>Proprietatea Clonei</secondary><tertiary>notify</tertiary></indexterm>

source: When stopping or starting a copy of the clone, tell all the other copies beforehand and when the action was successful. Allowed values: <emphasis>false</emphasis>, <literal>true</literal>
ro_ro: Când este oprită sau pornită o copie a clonei, comunică tuturor celorlalte copii înainte şi după ce acţiunea a reuşit. Valori permise: <emphasis>false</emphasis>, <literal>true</literal>

source: <indexterm significance="preferred"><primary>globally-unique Clone Resource Property</primary></indexterm> <indexterm><primary>Clone Resource Properties</primary><secondary>globally-unique</secondary></indexterm> <indexterm><primary>Resource</primary><secondary>Clone Property</secondary><tertiary>globally-unique</tertiary></indexterm> globally-unique
ro_ro: <indexterm significance="preferred"><primary>globally-unique Proprietatea unei Resurse Clonă</primary></indexterm> <indexterm><primary>Proprietățile unei Resurse Clonă</primary><secondary>globally-unique</secondary></indexterm> <indexterm><primary>Resursă</primary><secondary>Proprietatea Clonei</secondary><tertiary>globally-unique</tertiary></indexterm> globally-unique

source: Does each copy of the clone perform a different function? Allowed values: <emphasis>false</emphasis>, <literal>true</literal>
ro_ro: Efectuează fiecare copie a unei clone o funcţie diferită? Valori permise: <emphasis>false</emphasis>, <literal>true</literal>

source: <indexterm significance="preferred"><primary>ordered Clone Resource Property</primary></indexterm> <indexterm><primary>Clone Resource Properties</primary><secondary>ordered</secondary></indexterm> <indexterm><primary>Resource</primary><secondary>Clone Property</secondary><tertiary>ordered</tertiary></indexterm> ordered
ro_ro: <indexterm significance="preferred"><primary>ordered Proprietatea Resursei Clonă</primary></indexterm> <indexterm><primary>Proprietățile Resursei Clonă</primary><secondary>ordered</secondary></indexterm> <indexterm><primary>Resursă</primary><secondary>Proprietatea Clonei</secondary><tertiary>ordered</tertiary></indexterm> ordered

source: Should the copies be started in series (instead of in parallel). Allowed values: <emphasis>false</emphasis>, <literal>true</literal>
ro_ro: Ar trebui copiile să fie pornite secvenţial (în loc de în paralel). Valori permise: <emphasis>false</emphasis>, <literal>true</literal>

source: <indexterm significance="preferred"><primary>interleave Clone Resource Property</primary></indexterm> <indexterm><primary>Clone Resource Properties</primary><secondary>interleave</secondary></indexterm> <indexterm><primary>Resource</primary><secondary>Clone Property</secondary><tertiary>interleave</tertiary></indexterm> interleave
ro_ro: <indexterm significance="preferred"><primary>interleave Proprietatea Resursei Clonă</primary></indexterm> <indexterm><primary>Proprietățile Resursei Clonă</primary><secondary>interleave</secondary></indexterm> <indexterm><primary>Resursă</primary><secondary>Proprietatea Clonei</secondary><tertiary>interleave</tertiary></indexterm>

source: Changes the behavior of ordering constraints (between clones/masters) so that instances can start/stop as soon as their peer instance has (rather than waiting for every instance of the other clone has). Allowed values: <emphasis>false</emphasis>, <literal>true</literal>
ro_ro: Schimbă comportamentul de ordonare al restricţiilor (între clone/masters) astfel încât instanţele să se poată porni/opri de îndată ce şi instanţa vecină a făcut-o (decât să aştepte pentru fiecare instanţă pe care o are clona cealaltă). Valori permise: <emphasis>false</emphasis>, <literal>true</literal>

source: Clones have no instance attributes; however, any that are set here will be inherited by the clone's children.
ro_ro: Clonele nu au atribute de instanţă, totuşi cele care sunt setate aici vor fi moştenite de copiii clonei.

source: Clones must contain exactly one group or one regular resource.
ro_ro: Clonele trebuie să conţină fix un grup sau o resursă obişnuită.

source: You should never reference the name of a clone's child. If you think you need to do this, you probably need to re-evaluate your design.
ro_ro: Nu ar trebui să referenţiaţi niciodată numele copilului unei clone. Dacă se consideră că este necesar acest lucru, probabil trebuie sa re-evaluaţi design-ul vostru.

source: In most cases, a clone will have a single copy on each active cluster node. If this is not the case, you can indicate which nodes the cluster should preferentially assign copies to with resource location constraints. These constraints are written no differently to those for regular resources except that the clone's id is used.
ro_ro: În majoritatea cazurilor, o clonă va avea o singură copie pe fiecare nod activ din cluster. Totuşi dacă nu este cazul, puteţi indica prin restricţii de locaţie a resursei către care noduri ar trebui clusterul să asigneze în mod preferenţial copiile. Aceste restricţii nu sunt scrise în mod diferit faţă de cele pentru resurse obişnuite cu excepţia faptului că id-ul clonei este folosit.

source: Ordering constraints behave slightly differently for clones. In the example below, <literal>apache-stats</literal> will wait until all copies of the clone that need to be started have done so before being started itself. Only if <emphasis>no</emphasis> copies can be started <literal>apache-stats</literal> will be prevented from being active. Additionally, the clone will wait for <literal>apache-stats</literal> to be stopped before stopping the clone.
ro_ro: Restricţiile de ordonare se comportă uşor diferit în cazul clonelor. În exemplele de mai jos, <literal>apache-stats</literal> va aştepta până ce toate copiile clonelor care trebuie să fie pornite au făcut acest lucru înainte ca aceasta să fie pornită la rândul ei. Doar dacă <emphasis>nici o</emphasis> copie nu poate fi pornită va fi împiedicată <literal>apache-stats</literal> din a fi activă. În plus, clona va aştepta ca apache-stats să fie oprită înainte de a opri clona.

source: Colocation of a regular (or group) resource with a clone means that the resource can run on any machine with an active copy of the clone. The cluster will choose a copy based on where the clone is running and the resource's own location preferences.
ro_ro: Colocarea unei resurse obişnuite (sau a unui grup) cu o clonă înseamnă că resursa poate rula pe orice maşină cu o copie activă a clonei. Clusterul va alege o copie ţinând cont unde rulează în mod curent clona şi de preferinţele proprii de locaţie ale resursei.

source: Colocation between clones is also possible. In such cases, the set of allowed locations for the clone is limited to nodes on which the clone is (or will be) active. Allocation is then performed as normally.
ro_ro: Colocarea între clone este posibilă de asemenea. În astfel de cazuri, setul de locaţii permise pentru clonă este limitat la nodurile pe care clona alături de care va fi colocată este (sau va fi) activă. Alocarea este mai apoi efectuată în mod normal.

source: Example constraints involving clones
ro_ro: Exemple de restricţii implicând clone

source: Stickiness
ro_ro: Adezivitate

source: <indexterm><primary>resource-stickiness</primary><secondary>of a Clone Resource</secondary></indexterm> To achieve a stable allocation pattern, clones are slightly sticky by default. If no value for <literal>resource-stickiness</literal> is provided, the clone will use a value of 1. Being a small value, it causes minimal disturbance to the score calculations of other resources but is enough to prevent Pacemaker from needlessly moving copies around the cluster.
ro_ro: <indexterm><primary>resource-stickiness</primary><secondary>a unei Resurse Clonă</secondary></indexterm> Pentru a atinge un tipar de alocare stabil, clonele sunt uşor adezive în mod implicit. Dacă nu este furnizată nici o valoare pentru <literal>resource-stickiness</literal>, clona va folosi valoarea 1. Fiind o valoare mică, aceasta cauzează o perturbare minimală a calcului scorului celorlalte resurse dar este suficientă pentru a împiedica Pacemaker-ul de a muta inutil copiile prin cluster.

source: Resource Agent Requirements
ro_ro: Cerinţele Agentului de Resursă

source: Any resource can be used as an anonymous clone, as it requires no additional support from the resource agent. Whether it makes sense to do so depends on your resource and its resource agent.
ro_ro: Orice resursă poate fi utilizată ca o clonă anonimă deoarece nu necesită vreun suport adiţional din partea agentului de resursă. Dacă are logică să facă acest lucru depinde de resursa voastră şi de agentul de resursă aferent.

source: Globally unique clones do require some additional support in the resource agent. In particular, it must only respond with <envar>${OCF_SUCCESS}</envar> if the node has that exact instance active. All other probes for instances of the clone should result in <envar>${OCF_NOT_RUNNING}</envar>. Unless of course they are failed, in which case they should return one of the other OCF error codes.
ro_ro: Clonele unice la nivel global necesită suport adiţional în agentul de resursă. În special, trebuie să răspundă doar cu <envar>${OCF_SUCCESS}</envar> dacă nodul are exact acea instanţă activă. Tot restul de probe pentru instanţe ale clonei ar trebui să rezulte în <envar>${OCF_NOT_RUNNING}</envar>. Cu excepţia cazului în care au eşuat, caz în care ar trebui să returneze unul din celelalte coduri de eroare OCF.

source: Copies of a clone are identified by appending a colon and a numerical offset, eg. <literal>apache:2</literal>.
ro_ro: Copiile unei clone sunt identificate prin sufixarea a două puncte şi a unui delimitator numeric. Ex. <literal>apache:2</literal>

source: Resource agents can find out how many copies there are by examining the <envar>OCF_RESKEY_CRM_meta_clone_max</envar> environment variable and which copy it is by examining <envar>OCF_RESKEY_CRM_meta_clone</envar>.
ro_ro: Agenţii de resursă pot afla câte copii există prin examinarea variabilei de mediu <envar>OCF_RESKEY_CRM_meta_clone_max</envar> şi a cărei copii este cea curentă examinând <envar>OCF_RESKEY_CRM_meta_clone</envar>.

source: You should not make any assumptions (based on <envar>OCF_RESKEY_CRM_meta_clone</envar>) about which copies are active. In particular, the list of active copies will not always be an unbroken sequence, nor always start at 0.
ro_ro: Nu ar trebui să faceţi presupuneri (pe baza <envar>OCF_RESKEY_CRM_meta_clone</envar>) în privinţa căror copii sunt active. În special, lista de copii active nu va fi întotdeauna o secvenţă continuă, nici nu va începe întotdeauna de la 0.

source: Notifications
ro_ro: Notificări
