Repository: ClusterLabs/pacemaker
Catalog: doc/Pacemaker_Explained/*/Ch-Advanced-Resources.po
Languages: ro_ro

source: <literal>Active</literal> resources:
ro_ro: Resursele <literal>Active</literal>:

source: <literal>Slave</literal> resources:
ro_ro: Resursele <literal>Slave</literal>:

source: Post-notification (start) / Pre-notification (promote)
ro_ro: Post-notificare (pornire) / Pre-notificare (promovează)

source: Post-notification (promote)
ro_ro: Post-notificare (promovează)

source: Resources that were promoted: <envar>$OCF_RESKEY_CRM_meta_notify_promote_resource</envar>
ro_ro: Resursele care au fost promovate: <envar>$OCF_RESKEY_CRM_meta_notify_promote_resource</envar>
