Repository: ClusterLabs/pacemaker
Catalog: doc/Pacemaker_Explained/*/Ch-Advanced-Resources.po
Languages: ro_ro

source: <indexterm significance="preferred"><primary>then-action Multi-State Resource Constraints</primary></indexterm> <indexterm><primary>Multi-State Resource Constraints</primary><secondary>then-action</secondary></indexterm> <indexterm><primary>Resource</primary><secondary>Multi-State Constraints</secondary><tertiary>then-action</tertiary></indexterm> then-action
ro_ro: <indexterm significance="preferred"><primary>then-action Restricții Resursă Multi-State</primary></indexterm> <indexterm><primary>Restricții Resursă Multi-State</primary><secondary>then-action</secondary></indexterm> <indexterm><primary>Resursă</primary><secondary>Restricții Multi-State</secondary><tertiary>then-action</tertiary></indexterm> then-action

source: An additional attribute of ordering constraints that specifies the action that the <literal>then</literal> resource can only execute after the <literal>first-action</literal> on the <literal>first</literal> resource has completed. Allowed values: <literal>start</literal>, <literal>stop</literal>, <literal>promote</literal>, <literal>demote</literal>. Defaults to the value (specified or implied) of <literal>first-action</literal>.
ro_ro: Un atribut adiţional al restricţiilor de ordonare care specifică acţiunea pe care resursa <literal>then</literal> o poate executa doar după ce <literal>first-action</literal> asupra resursei <literal>first</literal> a terminat. Valori permise: <emphasis>start</emphasis>, <literal>stop</literal>, <literal>promote</literal>, <literal>demote</literal>. Valoarea implicită (specificată sau subînțeleasă) a <literal>first-action</literal>.

source: In the example below, <literal>myApp</literal> will wait until one of the database copies has been started and promoted to master before being started itself. Only if no copies can be promoted will <literal>apache-stats</literal> be prevented from being active. Additionally, the database will wait for <literal>myApp</literal> to be stopped before it is demoted.
ro_ro: În exemplul de mai jos, <literal>myApp</literal> va aştepta până când una din copiile bazei de date a fost pornită şi promovată la master înainte de a fi ea însăşi pornită. Doar dacă nici o copie nu poate fi promovată va fi împiedicată <literal>apache-stats</literal> de a fi activă. În mod adiţional, baza de date va aştepta ca <literal>myApp</literal> să fie oprită înainte să fie degradată.

source: Example constraints involving multi-state resources
ro_ro: Exemple de restricţii implicând resurse multi-state

source: Colocation of a regular (or group) resource with a multi-state resource means that it can run on any machine with an active copy of the multi-state resource that is in the specified state (<literal>Master</literal> or <literal>Slave</literal>). In the example, the cluster will choose a location based on where database is running as a <literal>Master</literal>, and if there are multiple <literal>Master</literal> instances it will also factor in <literal>myApp</literal>'s own location preferences when deciding which location to choose.
ro_ro: Colocarea unei resurse obişnuite (sau a unui grup) cu o resursă multi-state înseamnă că poate rula pe orice maşină cu o copie activă a resursei multi-state care se alfă în starea specificată (<literal>Master</literal> sau <literal>Slave</literal>). În exemplu, clusterul va alege o locaţie în funcţie de unde rulează baza de date în mod curent ca <literal>Master</literal>, şi dacă sunt mai multe instanţe de <literal>Master</literal> va lua în considerare şi preferinţele proprii de locaţie ale <literal>myApp</literal> când va decide care locaţie să aleagă.

source: Colocation with regular clones and other multi-state resources is also possible. In such cases, the set of allowed locations for the <literal>rsc</literal> clone is (after role filtering) limited to nodes on which the <literal>with-rsc</literal> multi-state resource is (or will be) in the specified role. Allocation is then performed as-per-normal.
ro_ro: Colocarea alături de clone obişnuite şi alte resurse multi-state este posibilă de asemenea. În astfel de cazuri, setul de locaţii permise pentru clona <literal>rsc</literal> este (după filtrarea rolului) limitat la nodurile pe care resursa multi-state <literal>with-rsc</literal> există (sau va exista) în rolul specificat. Alocarea este atunci efectuată în mod normal.

source: <indexterm><primary>resource-stickiness</primary><secondary>of a Multi-State Resource</secondary></indexterm> To achieve a stable allocation pattern, multi-state resources are slightly sticky by default. If no value for <literal>resource-stickiness</literal> is provided, the multi-state resource will use a value of 1. Being a small value, it causes minimal disturbance to the score calculations of other resources but is enough to prevent Pacemaker from needlessly moving copies around the cluster.
ro_ro: <indexterm><primary>resource-stickiness</primary><secondary> unei Resurse Multi-State</secondary></indexterm> Pentru a atinge un tipar de alocare stabil, resursele multi-state sunt uşor adezive în mod implicit. Dacă nu este furnizată nici o valoare pentru <literal>resource-stickiness</literal>, resursa multi-state va folosi valoarea 1. Fiind o valoare mică, aceasta cauzează o perturbare minimală a calcului scorului celorlalte resurse dar este suficientă pentru a împiedica Pacemaker-ul de a muta inutil copiile prin cluster.

source: Which Resource Instance is Promoted
ro_ro: Care Instanţă a Resursei este Promovată

source: During the start operation, most Resource Agent scripts should call the <command>crm_master</command> utility. This tool automatically detects both the resource and host and should be used to set a preference for being promoted. Based on this, <literal>master-max</literal>, and <literal>master-node-max</literal>, the instance(s) with the highest preference will be promoted.
ro_ro: În timpul operaţiunii de pornire, majoritatea scripturilor Agenţilor de Resursă ar trebui să apeleze utilitarul <command>crm_master</command>. Acesta detectează în mod automat atât resursa cât şi gazda şi ar trebui să fie folosit pentru a seta o preferinţă pentru a fi promovat. În funcţie de asta, de <literal>master-max</literal> şi de <literal>master-node-max</literal>, instanţa(ele) cu cea mai mare preferinţă va(vor) fi promovată(e).

source: The other alternative is to create a location constraint that indicates which nodes are most preferred as masters.
ro_ro: Cealaltă alternativă să se creeze o restricţie de locaţie care să indice care noduri sunt cele mai preferate ca masteri.

source: Manually specifying which node should be promoted
ro_ro: Specificând manual care nod ar trebui să fie promovat

source: Since multi-state resources are an extension of cloned resources, all the requirements of Clones are also requirements of multi-state resources. Additionally, multi-state resources require two extra actions: <literal>demote</literal> and <literal>promote</literal>; these actions are responsible for changing the state of the resource. Like <literal>start</literal> and <literal>stop</literal>, they should return <envar>OCF_SUCCESS</envar> if they completed successfully or a relevant error code if they did not.
ro_ro: Din moment ce resursele multi-state sunt o extensie a resurselor clonate, toate cerinţele Clonelor sunt de asemenea cerinţe ale resurselor multi-state. Adiţional, resursele multi-state necesită două acţiuni suplimentare: <literal>promote</literal> şi <literal>demote</literal>; aceste acţiuni sunt responsabile pentru schimbarea stării resursei. Precum <literal>start</literal> şi <literal>stop</literal>, acestea ar trebui să returneze <envar>OCF_SUCCESS</envar> dacă au terminat cu succes sau un cod de eroare relevant în caz contrar.

source: The states can mean whatever you wish, but when the resource is started, it must come up in the mode called <literal>Slave</literal>. From there the cluster will then decide which instances to promote to <literal>Master</literal>.
ro_ro: Stările pot însemna orice doriţi, dar atunci când resursa este pornită, trebuie să ajungă în modul numit <literal>Slave</literal>. De acolo clusterul va decide mai apoi care instanţe să promoveze într-un <literal>Master</literal>.

source: In addition to the Clone requirements for monitor actions, agents must also <emphasis>accurately</emphasis> report which state they are in. The cluster relies on the agent to report its status (including role) accurately and does not indicate to the agent what role it currently believes it to be in.
ro_ro: În plus faţă de cerinţele Clonelor pentru acţiunile de monitorizare, agenţii trebuie să raporteze <emphasis>corespunzător</emphasis> starea în care sunt. Clusterul se bazează pe agent să-şi raporteze statusul (incluzând rolul) în mod corespunzător şi nu indică agentului în care rol crede acesta în mod curent că ar trebui să se afle.

source: Role implications of OCF return codes
ro_ro: Implicaţiile rolurilor codurilor returnate de OCF

source: Monitor Return Code
ro_ro: Cod de Monitorizare Returnat

source: <indexterm><primary>return code</primary><secondary>OCF_NOT_RUNNING</secondary></indexterm> <indexterm><primary>Environment Variable</primary><secondary>OCF_NOT_RUNNING</secondary></indexterm> <indexterm><primary>OCF_NOT_RUNNING</primary></indexterm> OCF_NOT_RUNNING
ro_ro: <indexterm><primary>cod de ieșire</primary><secondary>OCF_NOT_RUNNING</secondary></indexterm> <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_NOT_RUNNING</secondary></indexterm> <indexterm><primary>OCF_NOT_RUNNING</primary></indexterm> OCF_NOT_RUNNING

source: Stopped
ro_ro: Oprit

source: <indexterm><primary>return code</primary><secondary>OCF_SUCCESS</secondary></indexterm> <indexterm><primary>Environment Variable</primary><secondary>OCF_SUCCESS</secondary></indexterm> <indexterm><primary>OCF_SUCCESS</primary></indexterm> OCF_SUCCESS
ro_ro: <indexterm><primary>cod de ieșire</primary><secondary>OCF_SUCCESS</secondary></indexterm> <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_SUCCESS</secondary></indexterm> <indexterm><primary>OCF_SUCCESS</primary></indexterm> OCF_SUCCESS

source: Running (Slave)
ro_ro: Rulând (Slave)

source: <indexterm><primary>return code</primary><secondary>OCF_RUNNING_MASTER</secondary></indexterm> <indexterm><primary>Environment Variable</primary><secondary>OCF_RUNNING_MASTER</secondary></indexterm> <indexterm><primary>OCF_RUNNING_MASTER</primary></indexterm> OCF_RUNNING_MASTER
ro_ro: <indexterm><primary>cod de ieșire</primary><secondary>OCF_RUNNING_MASTER</secondary></indexterm> <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RUNNING_MASTER</secondary></indexterm> <indexterm><primary>OCF_RUNNING_MASTER</primary></indexterm> OCF_RUNNING_MASTER

source: Running (Master)
ro_ro: Rulează (Master)

source: <indexterm><primary>return code</primary><secondary>OCF_FAILED_MASTER</secondary></indexterm> <indexterm><primary>Environment Variable</primary><secondary>OCF_FAILED_MASTER</secondary></indexterm> <indexterm><primary>OCF_FAILED_MASTER</primary></indexterm> OCF_FAILED_MASTER
ro_ro: <indexterm><primary>cod de ieșire</primary><secondary>OCF_FAILED_MASTER</secondary></indexterm> <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_FAILED_MASTER</secondary></indexterm> <indexterm><primary>OCF_FAILED_MASTER</primary></indexterm> OCF_FAILED_MASTER

source: Failed (Master)
ro_ro: Eşuat (Master)

source: Other
ro_ro: Altul

source: Failed (Slave)
ro_ro: Eşuat (Slave)

source: Like clones, supporting notifications requires the <literal>notify</literal> action to be implemented. Once supported the notify action will be passed a number of extra variables which, when combined with additional context, can be used to calculate the current state of the cluster and what is about to happen to it.
ro_ro: Ca şi în cazul clonelor, suportarea notificărilor necesită acţiunea <literal>notify</literal> să fie implementată. Odată ce este suportată, acţiunii notify îi vor fi trimise un număr de variabile suplimentare care, când sunt combinate cu un context suplimentar, pot fi folosite pentru a calcula starea curentă a clusterului şi ceea ce urmează să i se întâmple.

source: Environment variables supplied with <literal>Master</literal> notify actions<footnote><para>Emphasized variables are specific to <literal>Master</literal> resources and all behave in the same manner as described for Clone resources.</para></footnote>
ro_ro: Variabilele de mediu furnizate cu acţiunile de notificare <literal>Master</literal><footnote><para>Variabilele îngroşate sunt specifice resurselor Master şi se comportă toate în acelaşi fel ca şi cel descris pentru resursele Clonă.</para></footnote>

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_type</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_type</secondary></indexterm> <envar>OCF_RESKEY_CRM_meta_notify_type</envar>
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_type</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_type</secondary></indexterm> <envar>OCF_RESKEY_CRM_meta_notify_type</envar>

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_operation</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_operation</secondary></indexterm><envar>OCF_RESKEY_CRM_meta_notify_operation</envar>
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_operation</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_operation</secondary></indexterm><envar>OCF_RESKEY_CRM_meta_notify_operation</envar>

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_active_resource</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_active_resource</secondary></indexterm> <envar>OCF_RESKEY_CRM_meta_notify_active_resource</envar>
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_active_resource</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_active_resource</secondary></indexterm> <envar>OCF_RESKEY_CRM_meta_notify_active_resource</envar>

source: Resources the that are running
ro_ro: Resursele care rulează

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_inactive_resource</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_inactive_resource</secondary></indexterm> <envar>OCF_RESKEY_CRM_meta_notify_inactive_resource</envar>
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_inactive_resource</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_inactive_resource</secondary></indexterm> <envar>OCF_RESKEY_CRM_meta_notify_inactive_resource</envar>

source: Resources the that are not running
ro_ro: Resursele care nu rulează

source: <primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_master_resource</tertiary>
ro_ro: <primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_master_resource</tertiary>

source: Resources that are running in <literal>Master</literal> mode
ro_ro: Resursele care funcţionează în mod <literal>Master</literal>

source: <primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_slave_resource</tertiary>
ro_ro: <primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_slave_resource</tertiary>

source: Resources that are running in <literal>Slave</literal> mode
ro_ro: Resursele care funcţionează în mod <literal>Slave</literal>

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_start_resource</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_start_resource</secondary></indexterm> <envar>OCF_RESKEY_CRM_meta_notify_start_resource</envar>
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_start_resource</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_start_resource</secondary></indexterm> <envar>OCF_RESKEY_CRM_meta_notify_start_resource</envar>

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_stop_resource</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_stop_resource</secondary></indexterm> <envar>OCF_RESKEY_CRM_meta_notify_stop_resource</envar>
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_stop_resource</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_stop_resource</secondary></indexterm> <envar>OCF_RESKEY_CRM_meta_notify_stop_resource</envar>

source: <primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_promote_resource</tertiary>
ro_ro: <primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_promote_resource</tertiary>

source: Resources to be promoted
ro_ro: Resursele care vor fi promovate

source: <primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_demote_resource</tertiary>
ro_ro: <primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_demote_resource</tertiary>

source: Resources to be demoted
ro_ro: Resursele care vor fi degradate

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_start_uname</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_start_uname</secondary></indexterm> <envar>OCF_RESKEY_CRM_meta_notify_start_uname</envar>
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_start_uname</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_start_uname</secondary></indexterm> <envar>OCF_RESKEY_CRM_meta_notify_start_uname</envar>

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_stop_uname</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_stop_uname</secondary></indexterm> <envar>OCF_RESKEY_CRM_meta_notify_stop_uname</envar>
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_stop_uname</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_stop_uname</secondary></indexterm> <envar>OCF_RESKEY_CRM_meta_notify_stop_uname</envar>

source: <primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_promote_uname</tertiary>
ro_ro: <primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_promote_uname</tertiary>

source: Nodes on which resources will be promoted
ro_ro: Nodurile pe care resursele vor fi promovate

source: <primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_demote_uname</tertiary>
ro_ro: <primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_demote_uname</tertiary>

source: Nodes on which resources will be demoted
ro_ro: Nodurile pe care resursele vor fi degradate

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_active_uname</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_active_uname</secondary></indexterm> <envar>OCF_RESKEY_CRM_meta_notify_active_uname</envar>
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_active_uname</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_active_uname</secondary></indexterm> <envar>OCF_RESKEY_CRM_meta_notify_active_uname</envar>

source: <indexterm><primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_inactive_uname</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_inactive_uname</secondary></indexterm> <envar>OCF_RESKEY_CRM_meta_notify_inactive_uname</envar>
ro_ro: <indexterm><primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_inactive_uname</tertiary></indexterm> <indexterm><primary>OCF_RESKEY_CRM_</primary><secondary>meta_notify_inactive_uname</secondary></indexterm> <envar>OCF_RESKEY_CRM_meta_notify_inactive_uname</envar>

source: <primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_master_uname</tertiary>
ro_ro: <primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_master_uname</tertiary>

source: Nodes on which resources are running in <literal>Master</literal> mode
ro_ro: Nodurile pe care resursele rulează în modul <literal>Master</literal>

source: <primary>Environment Variable</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_slave_uname</tertiary>
ro_ro: <primary>Variabilă de Mediu</primary><secondary>OCF_RESKEY_CRM_</secondary><tertiary>_meta_notify_slave_uname</tertiary>

source: Nodes on which resources are running in <literal>Slave</literal> mode
ro_ro: Nodurile pe care resursele rulează în modul <literal>Slave</literal>

source: Pre-notification (demote):
ro_ro: Pre-notificare (degradează)

source: <literal>Active</literal> resources: <envar>$OCF_RESKEY_CRM_meta_notify_active_resource</envar>
ro_ro: Resursele <literal>Active</literal>: <envar>$OCF_RESKEY_CRM_meta_notify_active_resource</envar>

source: <literal>Master</literal> resources: <envar>$OCF_RESKEY_CRM_meta_notify_master_resource</envar>
ro_ro: Resursele <literal>Master</literal>: <envar>$OCF_RESKEY_CRM_meta_notify_master_resource</envar>

source: <literal>Slave</literal> resources: <envar>$OCF_RESKEY_CRM_meta_notify_slave_resource</envar>
ro_ro: Resursele <literal>Slave</literal>: <envar>$OCF_RESKEY_CRM_meta_notify_slave_resource</envar>

source: Resources to be promoted: <envar>$OCF_RESKEY_CRM_meta_notify_promote_resource</envar>
ro_ro: Resursele care vor fi promovate: <envar>$OCF_RESKEY_CRM_meta_notify_promote_resource</envar>

source: Resources to be demoted: <envar>$OCF_RESKEY_CRM_meta_notify_demote_resource</envar>
ro_ro: Resursele care vor fi degradate: <envar>$OCF_RESKEY_CRM_meta_notify_demote_resource</envar>

source: Post-notification (demote) / Pre-notification (stop):
ro_ro: Post-notificare (degradează) / Pre-notificare (oprire)

source: <literal>Master</literal> resources:
ro_ro: Resurse <literal>Master</literal>:

source: Resources that were demoted: <envar>$OCF_RESKEY_CRM_meta_notify_demote_resource</envar>
ro_ro: Resurse care au fost degradate: <envar>$OCF_RESKEY_CRM_meta_notify_demote_resource</envar>

source: Post-notification (stop) / Pre-notification (start)
ro_ro: Post-notificare (oprire) / Pre-notificare (pornire)
