Repository: ClusterLabs/Pacemaker
Catalog: doc/Pacemaker_Explained/*/Ch-Nodes.po
Languages: ro_ro

source: Cluster Nodes
ro_ro: Nodurile Clusterului

source: Defining a Cluster Node
ro_ro: Definirea unui Nod de Cluster

source: Each node in the cluster will have an entry in the nodes section containing its UUID, uname and type.
ro_ro: Fiecare nod în cluster va avea o intrare în secţiunea de noduri conţinând UUID-ul, uname-ul şi tipul acestuia.

source: Example cluster node entry
ro_ro: Exemplu de intrare de nod de cluster

source: In normal circumstances, the admin should let the cluster populate this information automatically from the communications and membership data. However one can use the crm_uuid tool to read an existing UUID or define a value before the cluster starts.
ro_ro: În circumstanţe normale, admin-ul ar trebui să lase clusterul să populeze această informaţie în mod automat din datele de comunicare şi apartenenţă. Totuşi cineva poate folosi utilitarul crm_uuid pentru a citi un UUID existent sau pentru a defini o valoare înainte să pornească clusterul.

source: Describing a Cluster Node
ro_ro: Descrierea unui Nod de Cluster

source: Beyond the basic definition of a node, the administrator can also describe the node's attributes, such as how much RAM, disk, what OS or kernel version it has, perhaps even its physical location. This information can then be used by the cluster when deciding where to place resources. For more information on the use of node attributes, see the section on <xref linkend="ch-rules"/>.
ro_ro: Dincolo de definiţia de bază a unui nod, administratorul poate descrie de asemenea şi atributele nodului, cum ar fi cât de mult RAM, disc are, care OS sau versiune de kernel are, poate chiar şi locaţia fizică. Această informaţie poate fi utilizată mai apoi de către cluster când va decide unde să plaseze resursele. Pentru mai multe informaţii referitoare la folosirea atributelor nodului, vedeţi secţiunea despre <xref linkend="ch-rules"/>.

source: Node attributes can be specified ahead of time or populated later, when the cluster is running, using <command>crm_attribute</command>.
ro_ro: Atributele nodului pot fi specificate în avans sau populate ulterior, când clusterul rulează, folosind <command>crm_attribute</command>.

source: Below is what the node's definition would look like if the admin ran the command:
ro_ro: Mai jos este prezentat cum ar arăta definiţia nodului dacă administratorul ar executa comanda:

source: The result of using crm_attribute to specify which kernel pcmk-1 is running
ro_ro: Rezultatul folosirii crm_attribute pentru a specifica pe ce kernel rulează pcmk-1

source: A simpler way to determine the current value of an attribute is to use crm_attribute command again:
ro_ro: O metodă mai simplă de a determina valoarea curentă a unui atribut este de a folosi comanda crm_attribute din nou:

source: By specifying <parameter>--type</parameter> nodes the admin tells the cluster that this attribute is persistent. There are also transient attributes which are kept in the status section which are "forgotten" whenever the node rejoins the cluster. The cluster uses this area to store a record of how many times a resource has failed on that node but administrators can also read and write to this section by specifying <parameter>--type status</parameter>.
ro_ro: Prin specificarea <parameter>--type</parameter> noduri administratorul îi spune clusterului că acest atribut este persistent. Există de asemenea atribute tranzitive care sunt păstrate în secţiunea de status şi care sunt "uitate" oricând nodul se realătură clusterului. Clusterul foloseşte această zonă pentru a stoca o înregistrare despre de câte ori a eşuat o resursă pe acel nod însâ administratorii pot citi şi scrie în această secţiune prin specificarea a <parameter>--type status</parameter>.

source: Adding a New Cluster Node
ro_ro: Adăugarea unui Nou Nod în Cluster

source: Adding a new node is as simple as installing Corosync and Pacemaker, and copying <filename>/etc/corosync/corosync.conf</filename> and <filename>/etc/ais/authkey</filename> (if it exists) from an existing node. You may need to modify the mcastaddr option to match the new node's IP address.
ro_ro: Adăugarea unui nou nod este la fel de simplă ca instalarea Corosync şi Pacemaker şi copierea <filename>/etc/corosync/corosync.conf</filename> şi a <filename>/etc/ais/authkey</filename> (dacă există) de pe un nod existent. Ar putea fi necesar să modificaţi opţiunea mcastaddr pentru a se potrivi cu adresa IP a noului nod.

source: If a log message containing "Invalid digest" appears from Corosync, the keys are not consistent between the machines.
ro_ro: Dacă apare în log-uri un mesaj de la Corosync conţinând "Invalid digest", cheile nu sunt consistente între maşini.

source: Provided you specified autojoin any in <filename>ha.cf</filename>, adding a new node is as simple as installing heartbeat and copying <filename>ha.cf</filename> and <filename>authkeys</filename> from an existing node.
ro_ro: Dacă aţi specificat autojoin any în <filename>ha.cf</filename>, adăugarea unui nod nou este la fel de simpla ca şi instalarea Heartbeat şi copierea <filename>ha.cf</filename> şi a <filename>authkeys</filename> de pe un nod existent.

source: If not, then after setting up <filename>ha.cf</filename> and <filename>authkeys</filename>, you must use the hb_addnode command before starting the new node.
ro_ro: În caz contrar, după setarea <filename>ha.cf</filename> şi a <filename>authkeys</filename>, trebuie să folosiţi comanda hb_addnode înainte de a porni noul nod.

source: Removing a Cluster Node
ro_ro: Înlăturarea unui Nod din Cluster

source: Because the messaging and membership layers are the authoritative source for cluster nodes, deleting them from the CIB is not a reliable solution. First one must arrange for heartbeat to forget about the node (<replaceable>pcmk-1</replaceable> in the example below).
ro_ro: Datorită faptului că straturile de mesagerie şi apartenenţă sunt surse autoritative pentru nodurile clusterului, ştergerea acestoa din CIB nu este o soluţie de încredere. Întâi cineva trebuie să facă astfel încât heartbeat să uite de nod (<replaceable>pcmk-1</replaceable> în exemplul de mai jos).

source: On the host to be removed:
ro_ro: Pe gazda care va fi înlăturată:

source: Find and record the node's Corosync id: <command>crm_node -i</command>
ro_ro: Găsiţi şi înregistraţi id-ul Corosync al nodului: <command>crm_node -i</command>

source: Stop the cluster: <command>/etc/init.d/corosync stop</command>
ro_ro: Opriţi clusterul: <command>/etc/init.d/corosync stop</command>

source: Next, from one of the remaining active cluster nodes:
ro_ro: Ulterior, de pe unul din nodurile rămase active ale clusterului:

source: Tell the cluster to forget about the removed host: <command>crm_node -R <replaceable>COROSYNC_ID</replaceable></command>
ro_ro: Comunicaţi clusterului să uite despre gazda înlăturată: <command>crm_node -R <replaceable>COROSYNC_ID</replaceable></command>

source: Only now is it safe to delete the node from the CIB with:
ro_ro: Doar acum este în siguranţă să ştergeţi nodul din CIB cu:

source: Because the messaging and membership layers are the authoritative source for cluster nodes, deleting them from the CIB is not a reliable solution. First one must arrange for heartbeat to forget about the node (pcmk-1 in the example below). To do this, shut down heartbeat on the node and then, from one of the remaining active cluster nodes, run:
ro_ro: Datorită faptului că straturile de mesagerie şi apartenenţă sunt surse autoritative pentru nodurile clusterului, ştergerea acestoa din CIB nu este o soluţie de încredere. Întâi cineva trebuie să facă astfel încât heartbeat să uite de nod (<replaceable>pcmk-1</replaceable> în exemplul de mai jos). Pentru a realiza acest lucru, opriţi heartbeat pe nod şi apoi, de pe unul din nodurile rămase active în cluster, rulaţi:

source: Only then is it safe to delete the node from the CIB with:
ro_ro: Doar acum este în siguranţă să ştergeţi nodul din CIB cu:

source: Replacing a Cluster Node
ro_ro: Înlocuirea unui Nod din Cluster

source: The five-step guide to replacing an existing cluster node:
ro_ro: Ghidul în cinci paşi pentru înlocuirea unui nod existent din cluster:

source: Make sure the old node is completely stopped
ro_ro: Asiguraţi-vă că nodul vechi este oprit de tot.

source: Give the new machine the same hostname and IP address as the old one
ro_ro: Daţi maşinii noi acelaşi hostname şi adresă IP ca celei vechi

source: Install the cluster software :-)
ro_ro: Instalaţi soft-ul de cluster :-)

source: Copy <filename>/etc/corosync/corosync.conf</filename> and <filename>/etc/ais/authkey</filename> (if it exists) to the new node
ro_ro: Copiaţi <filename>/etc/corosync/corosync.conf</filename> şi <filename>/etc/ais/authkey</filename> (dacă există) pe nodul nou

source: Start the new cluster node
ro_ro: Porniţi noul nod în cluster

source: The seven-step guide to replacing an existing cluster node:
ro_ro: Ghidul în şapte paşi pentru înlocuirea unui nod existent din cluster

source: Give the new machine the same hostname as the old one
ro_ro: Daţi maşinii noi acelaşi hostname ca şi celei vechi

source: Go to an active cluster node and look up the UUID for the old node in <filename>/var/lib/heartbeat/hostcache</filename>
ro_ro: Mergeţi pe un nod activ din cluster şi căutaţi UUID-ul nodului vechi în <filename>/var/lib/heartbeat/hostcache</filename>

source: Install the cluster software
ro_ro: Instalaţi soft-ul de cluster

source: Copy ha.cf and authkeys to the new node
ro_ro: Copiaţi <filename>ha.cf</filename> şi <filename>authkeys</filename> pe nodul nou

source: On the new node, populate it's UUID using crm_uuid -w and the UUID from step 2
ro_ro: Pe nodul nou, populaţi UUID-ul acestuia folosind crm_uuid -w şi UUID-ul prelevat de la pasul 2

source: translator-credits
ro_ro: genericul-traducătorului
