Repository: ClusterLabs/Pacemaker
Catalog: doc/Pacemaker_Explained/*/Ch-Resources.po
Languages: ro_ro

source: Cluster Resources
ro_ro: Resursele Clusterului

source: What is a Cluster Resource
ro_ro: Ce este o Resursă de Cluster

source: The role of a resource agent is to abstract the service it provides and present a consistent view to the cluster, which allows the cluster to be agnostic about the resources it manages. The cluster doesn't need to understand how the resource works because it relies on the resource agent to do the right thing when given a start, stop or monitor command.
ro_ro: Rolul agentului de resursă este de a abstractiza serviciul pe care îl furnizează şi de a prezenta o viziune consistentă clusterului, care îi permite clusterului să fie agnostic cu resursele pe care le gestionează. Clusterul nu trebuie să înţeleagă cum funcţionează resursa pentru că se bazează pe agentul de resursă să efectueze ceea ce trebuie atunci când îi este trimisă o comandă de start, stop sau monitor.

source: For this reason it is crucial that resource agents are well tested.
ro_ro: Din acest motiv este imperativ ca agenţii de resursă să fie testaţi corespunzător.

source: Typically resource agents come in the form of shell scripts, however they can be written using any technology (such as C, Python or Perl) that the author is comfortable with.
ro_ro: În mod normal agenţii de resursă vin sub forma de scripturi de shell, însă aceştia pot fi scrişi folosind orice limbaj de programare (cum ar fi C, Python sau Perl) cu care este confortabil autorul.

source: Supported Resource Classes
ro_ro: Clase de Resurse Suportate

source: There are three basic classes of agents supported by Pacemaker. In order of encouraged usage they are:
ro_ro: Există trei clase de bază de agenţi suportate de Pacemaker. În ordinea în care este încurajată folosirea acestora ele sunt:

source: Note: The Pacemaker implementation has been somewhat extended from the OCF Specs, but none of those changes are incompatible with the original OCF specification
ro_ro: Notă: Implementarea Pacemaker a fost oarecum extinsă din Specificaţiile OCF, dar nici una dintre modificările acelea sunt incompatibile cu specificaţia OCF originală.

source: The OCF Spec (as it relates to resource agents) can be found at: <ulink url="http://www.opencf.org/cgi-bin/viewcvs.cgi/specs/ra/resource-agent-api.txt?rev=HEAD"/><placeholder-1/> and is basically an extension of the Linux Standard Base conventions for init scripts to
ro_ro: Specificaţia OCF (în conjunctura agenţilor de resursă) poate fi găsită la: <ulink url="http://www.opencf.org/cgi-bin/viewcvs.cgi/specs/ra/resource-agent-api.txt?rev=HEAD"/><placeholder-1/> şi este în linii mari o extensie a convenţiilor stabilite de Linux Standard Base pentru scripturi de init ca să

source: support parameters
ro_ro: suporte parametri

source: make them self describing, and
ro_ro: să îi facă auto descriptivi şi

source: extensible
ro_ro: extensibili

source: Included with the cluster is the ocf-tester script which can be useful in this regard.
ro_ro: Inclus cu clusterul este scriptul ocf-tester care poate fi folositor în această privinţă.

source: OCF specs have strict definitions of what exit codes actions must return <placeholder-1/> The cluster follows these specifications exactly, and exiting with the wrong exit code will cause the cluster to behave in ways you will likely find puzzling and annoying. In particular, the cluster needs to distinguish a completely stopped resource from one which is in some erroneous and indeterminate state.
ro_ro: Specificaţiile OCF au definiţii stricte asupra căror coduri de ieşire trebuie să returneze acţiunile <placeholder-1/> Clusterul urmează aceste specificaţii întocmai, iar ieşirea din execuţie cu codul de eroare greşit va cauza clusterul să se comporte în feluri pe care le puteţi găsi enervante şi lipsite de sens. În mod special, clusterul trebuie să poată distinge între o resursă oprită complet şi una care se află într-o stare eronată sau nedeterminată.

source: Parameters are passed to the script as environment variables, with the special prefix <envar>OCF_RESKEY_</envar>. So, if you need to be given a parameter which the user thinks of as ip it will be passed to the script as <envar>OCF_RESKEY_ip</envar>. The number and purpose of the parameters is completely arbitrary, however your script should advertise any that it supports using the meta-data command.
ro_ro: Parametrii sunt pasaţi scriptului ca variabile de mediu, cu prefixul special <envar>OCF_RESKEY_</envar>. Deci, dacă trebuie să vi se dea un parametru pe care utilizatorul îl consideră ca fiind ip, acesta va fi pasat către script ca <envar>OCF_RESKEY_ip</envar>. Numărul şi scopul parametrilor este complet arbitrar, însă scriptul vostru ar trebui să îi anunţe pe toţi pe care îi suportă folosind comanda meta-data.

source: For more information, see <ulink url="http://www.linux-ha.org/wiki/OCF_Resource_Agents"/> and <xref linkend="ap-ocf"/>.
ro_ro: Pentru mai multe informaţii, vedeţi <ulink url="http://www.linux-ha.org/wiki/OCF_Resource_Agents"/> şi <xref linkend="ap-ocf"/>.

source: LSB resource agents are those found in <filename>/etc/init.d</filename>. Generally they are provided by the OS/distribution and in order to be used with the cluster, must conform to the LSB Spec.
ro_ro: Agenţii de resursă LSB sunt cei găsiţi în <filename>/etc/init.d</filename>. În mod normal aceştia sunt furnizaţi de către OS/distribuţie şi pentru a putea fi folosiţi împreună cu clusterul, trebuie să se conforme Specificaţiilor LSB.

source: The LSB Spec (as it relates to init scripts) can be found at: <ulink url="http://refspecs.linux-foundation.org/LSB_3.0.0/LSB-Core-generic/LSB-Core-generic/iniscrptact.html"/>
ro_ro: Specificaţiile LSB (în conjunctura scripturilor de init) pot fi găsite la: <ulink url="http://refspecs.linux-foundation.org/LSB_3.0.0/LSB-Core-generic/LSB-Core-generic/iniscrptact.html"/>

source: Many distributions claim LSB compliance but ship with broken init scripts. To see if your init script is LSB-compatible, see the FAQ entry <xref linkend="ap-lsb"/>. The most common problems are:
ro_ro: Multe distribuţii afirmă compatibilitatea LSB dar livrează scripturi de init nefuncţionale din acest punct de vedere. Pentru a vedea dacă scriptul vostru de init este compatibil LSB, vedeţi intrarea din FAQ referitoare la <xref linkend="ap-lsb"/>. Cele mai comune probleme sunt:

source: Not implementing the status operation at all
ro_ro: Neimplementarea în vreun fel a operaţiunii status

source: Not observing the correct exit status codes for start/stop/status actions
ro_ro: Neobservarea status-urilor corecte de ieşire pentru acţiuni start/stop/status

source: Starting a started resource returns an error (this violates the LSB spec)
ro_ro: Pornirea unei resurse deja pornite returnează o eroare (acest aspect încalcă specificaţia LSB)

source: Stopping a stopped resource returns an error (this violates the LSB spec)
ro_ro: Oprirea unei resurse deja oprită returnează o eroare (acest aspect încalcă specificaţia LSB)

source: Legacy Heartbeat
ro_ro: Moştenirea Heartbeat

source: Version 1 of Heartbeat came with its own style of resource agents and it is highly likely that many people have written their own agents based on its conventions. To enable administrators to continue to use these agents, they are supported by the new cluster manager.
ro_ro: Versiunea 1 de Heartbeat venea cu propriul stil de agenţi de resursă şi este foarte probabil că mulţi oameni şi-au scris proprii agenţi de resursă pe baza convenţiilor acestuia. Pentru a permite administratorilor să continue folosirea acestor agenţi, aceştia sunt suportaţi de către noul manager de cluster.

source: For more information, see: <ulink url="http://wiki.linux-ha.org/HeartbeatResourceAgent"/>
ro_ro: Pentru mai multe informaţii, vedeţi: <ulink url="http://wiki.linux-ha.org/HeartbeatResourceAgent"/>

source: The OCF class is the most preferred one as it is an industry standard, highly flexible (allowing parameters to be passed to agents in a non-positional manner) and self-describing.
ro_ro: Clasa OCF este cea mai preferată din moment ce este un standard al industriei, foarte flexibilă (permiţând parametrii să fie pasaţi agenţilor într-o manieră care nu ţine cont de poziţia acestora) şi auto-descriptivă.

source: There is also an additional class, STONITH, which is used exclusively for fencing related resources. This is discussed later in <xref linkend="ch-stonith"/>.
ro_ro: Mai există o clasă adiţională, STONITH, care este folosită exclusiv pentru resurse relevante în procesul de evacuare. Acest aspect este discutat mai târziu în <xref linkend="ch-stonith"/>.

source: Properties
ro_ro: Proprietăţi

source: These values tell the cluster which script to use for the resource, where to find that script and what standards it conforms to.
ro_ro: Aceste valori îi spun clusterului care script să îl folosească pentru resursă, unde să găsească acel script şi care sunt standardele sub care acesta aderă.

source: Properties of a Primitive Resource
ro_ro: Proprietăţile unei Resurse Primitive

source: Field
ro_ro: Câmp

source: Description
ro_ro: Descriere

source: Your name for the resource
ro_ro: Numele pe care îl daţi resursei

source: class
ro_ro: clasa

source: The standard the script conforms to. Allowed values: heartbeat, lsb, ocf, stonith
ro_ro: Standardul la care aderă scriptul. Valori permise: heartbeat, lsb, ocf, stonith

source: type
ro_ro: tipul

source: The name of the Resource Agent you wish to use. eg. IPaddr or Filesystem
ro_ro: Numele Agentului de Resursă pe care doriţi să îl folosiţi. ex. IPaddr sau Filesystem

source: provider
ro_ro: furnizor

source: The OCF spec allows multiple vendors to supply the same Resource Agent. To use the OCF resource agents supplied with Heartbeat, you should specify heartbeat here.
ro_ro: Specificaţia OCF permite mai multor entităţi să furnizeze acelaşi Agent de Resursă. Pentru a folosi agenţii de resursă OCF furnizaţi împreună cu Heartbeat, ar trebui să specificaţi heartbeat aici.

source: Resource definitions can be queried with the crm_resource tool. For example
ro_ro: Definiţiile resurselor pot fi interogate cu utilitarul crm_resource. De exemplu

source: might produce
ro_ro: ar putea produce următorul text de ieşire

source: An example LSB resource
ro_ro: Un exemplu de resursă LSB

source: One of the main drawbacks to LSB resources is that they do not allow any parameters
ro_ro: Una din principalele aspecte negative ale resurselor LSB este acela că nu permit parametri

source: or, for an OCF resource:
ro_ro: sau pentru o resursă OCF:

source: An example OCF resource
ro_ro: Un exemplu de resursă OCF

source: or, finally for the equivalent legacy Heartbeat resource:
ro_ro: sau în sfârşit pentru echivalentul unei resurse din moştenirea Heartbeat:

source: An example Heartbeat resource
ro_ro: Un exemplu de resursă Heartbeat

source: Heartbeat resources take only ordered and unnamed parameters. The supplied name therefore indicates the order in which they are passed to the script. Only single digit values are allowed.
ro_ro: Resursele Heartbeat primesc doar parametri ordonaţi şi fără denumire. Numele furnizat indică prin urmare ordinea în care sunt pasaţi către script. Doar valori formate dintr-o singură cifră sunt permise.

source: Resource Options
ro_ro: Opţiuni ale Resurselor

source: Options are used by the cluster to decide how your resource should behave and can be easily set using the <parameter>--meta</parameter> option of the <command>crm_resource</command> command.
ro_ro: Opţiunile sunt folosite de către cluster pentru a decide cum ar trebui să se comporte resursa voastră şi pot fi setate facil folosind opţiunea <parameter>--meta</parameter> a comenzii <command>crm_resource</command>.

source: Options for a Primitive Resource
ro_ro: Opţiuni pentru o Resursă Primitivă

source: Default
ro_ro: Valoarea implicită

source: priority
ro_ro: prioritate

source: If not all resources can be active, the cluster will stop lower priority resources in order to keep higher priority ones active.
ro_ro: Dacă nu pot fi active toate resursele , clusterul va opri resursele cu prioritate mai mică pentru a păstra resursele cu o prioritate mai mare active.

source: Started
ro_ro: Pornit

source: What state should the cluster attempt to keep this resource in? Allowed values:
ro_ro: În ce stare ar trebui să încerce clusterul să menţină această resursă? Valori permise:

source: Stopped - Force the resource to be stopped
ro_ro: Oprită - Forţează resursa să fie oprită

source: Started - Allow the resource to be started (In the case of <link linkend="s-resource-multistate">multi-state</link> resources, they will not promoted to master)
ro_ro: Pornită - Permite resursei să fie pornită (În cazul resurselor cu <link linkend="s-resource-multistate">multi-state</link>, acestea nu vor fi promovate la master)

source: Master - Allow the resource to be started and, if appropriate, promoted
ro_ro: Master - Permite resursei să fie pornită, iar dacă este adecvat, promovată

source: Is the cluster allowed to start and stop the resource? Allowed values: true, false
ro_ro: Îi este permis clusterului să pornească şi să oprească resursa? Valori permise: adevărat, fals

source: Inherited
ro_ro: Moştenită

source: How much does the resource prefer to stay where it is? Defaults to the value of resource-stickiness in the rsc_defaults section
ro_ro: Cât de mult preferă resursa să rămână acolo unde este? Valoarea implicită este cea a resource-stickiness din secţiunea rsc_defaults

source: INFINITY (disabled)
ro_ro: INFINIT (dezactivat)

source: How many failures should occur for this resource on a node before making the node ineligible to host this resource.
ro_ro: Câte eşecuri ar trebui să se întâmple acestei resurse pe un nod înainte de face nodul ineligibil de a mai găzdui această resursă.

source: 0 (disabled)
ro_ro: 0 (dezactivat)

source: How many seconds to wait before acting as if the failure had not occurred (and potentially allowing the resource back to the node on which it failed).
ro_ro: Câte secunde să aştepte înainte să se comporte ca şi cum eşecul nu s-ar fi întâmplat (şi potenţial să permită resursei să revină pe nodul pe care a eşuat).

source: What should the cluster do if it ever finds the resource active on more than one node. Allowed values:
ro_ro: Ce ar trebui să realizeze clusterul dacă găseşte vreodată o resursă activă pe mai mult de un nod. Valori permise:

source: block - mark the resource as unmanaged
ro_ro: block - marchează resursa ca fiind negestionată

source: stop_only - stop all active instances and leave them that way
ro_ro: stop_only - opreşte toate instanţele active şi lasă-le în acest fel

source: stop_start - stop all active instances and start the resource in one location only
ro_ro: stop_start - opreşte toate instanţele active şi porneşte resursa doar într-o singură locaţie

source: If you performed the following commands on the previous LSB Email resource
ro_ro: Dacă aţi efectuat următoarele comenzi pe resursa LSB Email anterioară

source: the resulting resource definition would be
ro_ro: definiţia rezultantă a resursei ar fi

source: An LSB resource with cluster options
ro_ro: O resursă LSB cu opţiuni ale clusterului

source: Setting Global Defaults for Resource Options
ro_ro: Setarea de Valori Implicite Globale pentru Opţiunile Clusterului

source: To set a default value for a resource option, simply add it to the <literal>rsc_defaults</literal> section with <command>crm_attribute</command>. Thus,
ro_ro: Pentru a seta o valoare implicită pentru o opţiune a resursei, pur şi simplu adăugaţi-o la secţiunea <literal>rsc_defaults</literal> cu <command>crm_attribute</command>. Astfel,

source: would prevent the cluster from starting or stopping any of the resources in the configuration (unless of course the individual resources were specifically enabled and had <literal>is-managed</literal> set to true).
ro_ro: ar preveni clusterul de a porni sau opri orice resurse din configuraţie (cu excepţia cazului când resursele individuale au fost activate în mod specific şi aveau <literal>is-managed</literal> setat pe true).

source: Instance Attributes
ro_ro: Atributele Instanţelor

source: The scripts of some resource classes (LSB not being one of them) can be given parameters which determine how they behave and which instance of a service they control.
ro_ro: Scripturile unor clase de resurse (LSB nefiind una dintre acestea) pot primi parametri care determină cum se comportă şi care instanţe ale unui serviciu controlează acestea.

source: If your resource agent supports parameters, you can add them with the <command>crm_resource</command> command. For instance
ro_ro: Dacă agentul vostru de resursă suportă parametri, îi puteţi adăuga cu comanda <command>crm_resource</command>. De exemplu

source: would create an entry in the resource like this
ro_ro: ar crea o intrare în resursă precum aceasta

source: An example OCF resource with instance attributes
ro_ro: Un exemplu de resursă OCF cu atribute de instanţă

source: For an OCF resource, the result would be an environment variable called <envar>OCF_RESKEY_ip</envar> with a value of 1.2.3.4
ro_ro: Pentru o resursă OCF, rezultatul ar fi o variabilă de mediu numită <envar>OCF_RESKEY_ip</envar> cu o valoare de 1.2.3.4

source: The list of instance attributes supported by an OCF script can be found by calling the resource script with the <parameter>meta-data</parameter> command. The output contains an XML description of all the supported attributes, their purpose and default values.
ro_ro: Lista de atribute de instanţă suportate de un script OCF poate fi găsită apelând scriptul resursei cu comanda <parameter>meta-data</parameter>. Rezultatul de ieşire conţine o descriere XML a tuturor atributelor suportate, scopul acestora şi valori implicite.

source: Displaying the metadata for the Dummy resource agent template
ro_ro: Afişarea metadata pentru template-ul agentului de resursă Dummy

source: Resource Operations
ro_ro: Operaţiile Resurselor

source: Monitoring Resources for Failure
ro_ro: Monitorizarea Resurselor pentru Defecţiuni

source: By default, the cluster will not ensure your resources are still healthy. To instruct the cluster to do this, you need to add a monitor operation to the resource's definition.
ro_ro: În mod implicit, clusterul nu va asigura că resursele voastre sunt încă sănătoase. Pentru a instrui clusterul să realizeze acest lucru, trebuie să adăugaţi o operaţiune de monitorizare la definiţia resursei.

source: An OCF resource with a recurring health check
ro_ro: O resursă OCF cu o verificare recurentă a sănătăţii

source: Properties of an Operation
ro_ro: Proprietăţile unei Operaţii

source: Your name for the action. Must be unique.
ro_ro: Numele dat acţiunii. Trebuie să fie unic.

source: name
ro_ro: nume

source: The action to perform. Common values: monitor, start, stop
ro_ro: Acţiunea pe care să o execute. Valori obişnuite: monitor, start, stop

source: How frequently (in seconds) to perform the operation. Default value: 0
ro_ro: Cât de frecvent (în secunde) să efectueze operaţiunea. Valoarea implicită: 0

source: timeout
ro_ro: interval

source: How long to wait before declaring the action has failed.
ro_ro: Cât de mult să aştepte înainte de a declara că acţiunea a eşuat.

source: requires
ro_ro: necesită

source: What conditions need to be satisfied before this action occurs. Allowed values:
ro_ro: Care condiţii trebuie să fie satisfăcute înainte ca această acţiune să se întâmple. Valori permise:

source: nothing - The cluster may start this resource at any time
ro_ro: nothing - Clusterul poate porni această resursă oricând

source: quorum - The cluster can only start this resource if a majority of the configured nodes are active
ro_ro: quorum - Clusterul poate porni această resursă dacă o majoritate a nodurilor configurate este activă

source: fencing - The cluster can only start this resource if a majority of the configured nodes are active <emphasis>and</emphasis> any failed or unknown nodes have been powered off.
ro_ro: fencing - Clusterul poate porni această resursă doar dacă o majoritate a nodurilor configurate este activă <emphasis>şi</emphasis> orice noduri necunoscute sau defectate au fost deconectate de la reţeaua de alimentare.

source: STONITH resources default to nothing, and all others default to fencing if STONITH is enabled and quorum otherwise.
ro_ro: Resursele STONITH nu au valori implicite, iar toate celelalte au ca valoare implicită evacuarea din cluster dacă STONITH este activat şi quorum în caz contrar.

source: The action to take if this action ever fails. Allowed values:
ro_ro: Acţiunea pe care să o execute dacă vreodată această acţiune eşuează. Valori permise:

source: ignore - Pretend the resource did not fail
ro_ro: ignore - Consideră că acţiunea nu a eşuat

source: block - Don't perform any further operations on the resource
ro_ro: block - Nu mai efectua operaţiuni ulterioare pe resursă

source: stop - Stop the resource and do not start it elsewhere
ro_ro: stop - Opreşte resursa şi nu o mai porni în altă parte

source: restart - Stop the resource and start it again (possibly on a different node)
ro_ro: restart - Opreşte resursa şi porneşte-o din nou (posibil pe un nod diferit)

source: fence - STONITH the node on which the resource failed
ro_ro: fence - STONITH nodul pe care resursa a eşuat

source: standby - Move <emphasis>all</emphasis> resources away from the node on which the resource failed
ro_ro: standby - Mută <emphasis>toate</emphasis> resursele de pe nodul pe care resursa a eşuat

source: The default for the stop operation is fence when STONITH is enabled and block otherwise. All other operations default to stop.
ro_ro: Valoarea implicită pentru operaţiunea stop este evacuarea din cluster atunci când STONITH este activat şi block în caz contrar. Toate celelalte operaţiuni au valoarea implicită stop.

source: enabled
ro_ro: activat

source: true
ro_ro: adevărat

source: If false, the operation is treated as if it does not exist. Allowed values: <placeholder-1/>, false
ro_ro: Dacă este setat pe fals, operaţiunea este tratată ca şi când nu ar exista. Valori permise: <placeholder-1/>, false

source: Setting Global Defaults for Operations
ro_ro: Setarea de Valori Implicite Globale pentru Operaţiuni

source: To set a default value for a operation option, simply add it to the op_defaults section with crm_attribute. Thus,
ro_ro: Pentru a seta valoarea implicită pentru opţiunea unei operaţiuni, pur şi simplu adăuga-ţi-o la secţiunea op_defaults cu crm_attribute. Prin urmare,

source: would default each operation's timeout to 20 seconds. If an operation's definition also includes a value for <literal>timeout</literal>, then that value would be used instead (for that operation only).
ro_ro: ar seta valoarea implicită a intervalului de expirare al fiecărei operaţiuni la 20 de secunde. Dacă definiţia unei operaţiuni include de asemenea o valoare pentru <literal>timeout</literal>, atunci acea valoare ar fi folosită în schimb (numai pentru acea operaţiune).

source: When Resources Take a Long Time to Start/Stop
ro_ro: Când Resursele Durează Mult Timp să Pornească/Oprească

source: There are a number of implicit operations that the cluster will always perform - start, stop and a non-recurring monitor operation (used at startup to check the resource isn't already active). If one of these is taking too long, then you can create an entry for them and simply specify a new value.
ro_ro: Sunt un număr de operaţiuni implicite pe care clusterul pe va efectua întotdeauna - start, stop şi o operaţiune monitor nerecurentă (folosită la pornire pentru a verifica dacă resursa nu este deja activă). Dacă una din aceste operaţiuni durează prea mult, atunci puteţi crea o intrare pentru acestea şi să specificaţi o valoarea nouă.
