Repository: ClusterLabs/Pacemaker
Catalog: doc/Pacemaker_Explained/*/Ch-Rules.po
Languages: ro_ro

source: Rules
ro_ro: Reguli

source: Rules can be used to make your configuration more dynamic. One common example is to set one value for resource-stickiness during working hours, to prevent resources from being moved back to their most preferred location, and another on weekends when no-one is around to notice an outage.
ro_ro: Regulile pot fi folosite pentru a face configuraţia voastră mai dinamică. Un exemplu comun este de a seta o valoare pentru resource-stickiness în timpul orelor de program, pentru a împiedica resursele de a fi mutate înapoi la locaţia cea mai preferată a acestora, iar altă valoare în weekend-uri când nu este nimeni în preajmă să detecteze o întrerupere a serviciului.

source: Another use of rules might be to assign machines to different processing groups (using a node attribute) based on time and to then use that attribute when creating location constraints.
ro_ro: O altă utilizare a regulilor ar putea fi pentru a asigna maşini la grupuri de procesare diferite (folosind un atribut de nod) bazat pe timp şi mai apoi să folosească acel atribut pentru a crea o restricţie de locaţie.

source: Each rule can contain a number of expressions, date-expressions and even other rules. The results of the expressions are combined based on the rule's boolean-op field to determine if the rule ultimately evaluates to true or false. What happens next depends on the context in which the rule is being used.
ro_ro: Fiecare regulă poate conţine un număr de expresii, expresii de dată şi chiar si alte reguli. Rezultatele expresiilor sunt combinate pe baza câmpului boolean op al regulii pentru a determina dacă regula în ultimă instanţă este evaluată ca adevărat sau fals. Ce se întâmplă mai departe depinde de contextul în care regula este folosită.

source: Properties of a Rule
ro_ro: Proprietăţile unei Reguli

source: Field
ro_ro: Câmp

source: Description
ro_ro: Descriere

source: role
ro_ro: rol

source: Started
ro_ro: Pornită

source: Limits the rule to only apply when the resource is in that role. Allowed values: <placeholder-1/>, Slave, Master. NOTE: A rule with role="Master" can not determine the initial location of a clone instance. It will only affect which of the active instances will be promoted.
ro_ro: Limitează regula pentru a se aplica numai când resursa se află în acel rol. Valori permise: <placeholder-1/>, Slave, Master. NOTĂ: O regulă cu rolul="Master" nu poate determina locaţia iniţială a unei instanţe ale unei clone. Va afecta numai care dintre instanţele active va fi promovată.

source: score
ro_ro: scor

source: The score to apply if the rule evaluates to "true". Limited to use in rules that are part of location constraints.
ro_ro: Scorul pe care să îl aplice în cazul în care regula este evaluată la "true". Limitată la folosirea în reguli care sunt parte din restricţiile de locaţie.

source: The node attribute to look up and use as a score if the rule evaluates to "true". Limited to use in rules that are part of location constraints.
ro_ro: Atributul nodului pe care să îl caute şi pe care să îl folosească drept scor dacă regula se evaluează la "true". Limitată la folosirea în reguli care sunt parte din restricţii de locaţie.

source: and
ro_ro: şi

source: How to combine the result of multiple expression objects. Allowed values: <placeholder-1/>, or
ro_ro: Cum să combinaţi rezultatul mai multor obiecte de expresii. Valori permise: <placeholder-1/>, sau

source: Node Attribute Expressions
ro_ro: Expresiile Atributelor de Nod

source: Expression objects are used to control a resource based on the attributes defined by a node or nodes. In addition to any attributes added by the administrator, each node has a built-in node attribute called <literal>#uname</literal> that can also be used.
ro_ro: Obiectele de expresie sunt folosite pentru a controla o resursă pe baza atributelor definite de un nod sau de mai multe noduri. Adiţional la orice atribute adăugate de administrator, fiecare nod are un atribut de nod predefinit numit <literal>#uname</literal> care poate fi folosit de asemenea.

source: Properties of an Expression
ro_ro: Proprietăţile unei Expresii

source: value
ro_ro: valoarea

source: User supplied value for comparison
ro_ro: Valorea furnizată de utilizator pentru comparaţie

source: attribute
ro_ro: atributul

source: The node attribute to test
ro_ro: Atributul nodului care să fie testat

source: type
ro_ro: tipul

source: string
ro_ro: şir

source: Determines how the value(s) should be tested. Allowed values: integer, <placeholder-1/>, version
ro_ro: Determină cum ar trebui să fie testate valorile. Valori permise: întreg, <placeholder-1/>, versiune

source: operation
ro_ro: operaţiune

source: The comparison to perform. Allowed values:
ro_ro: Comparaţia pe care să o efectueze. Valori permise:

source: lt - True if the node attribute's value is less than value
ro_ro: lt - Adevărat dacă valoarea atributului nodului este mai mică decât valoare

source: gt - True if the node attribute's value is greater than value
ro_ro: gt - Adevărat dacă valoarea atributului nodului este mai mare decât valoare

source: lte - True if the node attribute's value is less than or equal to value
ro_ro: lte - Adevărat dacă valoarea atributului nodului este mai mică sau egală cu valoare

source: gte - True if the node attribute's value is greater than or equal to value
ro_ro: gte - Adevărat dacă valoarea atributului nodului este mai mare sau egală cu valoare

source: eq - True if the node attribute's value is equal to value
ro_ro: eq - Adevărat dacă valoarea atributului nodului este egală cu valoare

source: ne - True if the node attribute's value is not equal to value
ro_ro: ne - Adevărat dacă valoarea atributului nodului nu este egală cu valoare

source: defined - True if the node has an the named attribute
ro_ro: defined - Adevărat dacă nodul are un atribut numit

source: not_defined - True if the node does not have the named attribute
ro_ro: not_defined - Adevărat dacă nodul nu are un atribut numit

source: Time/Date Based Expressions
ro_ro: Expresii Bazate pe Timp/Dată

source: As the name suggests, date_expressions are used to control a resource or cluster option based on the current date/time. They can contain an optional <literal>date_spec</literal> and/or <literal>duration</literal> object depending on the context.
ro_ro: După cum sugerează numele, date_expressions sunt folosite pentru a controla o resursă sau opţiune a clusterului pe baza timpului/dăţii curente. Acestea pot conţine opţional obiecte <literal>date_spec</literal> şi/sau <literal>duration</literal> în funcţie de context.

source: Properties of a Date Expression
ro_ro: Proprietăţile unei Expresii de Dată

source: start
ro_ro: început

source: A date/time conforming to the ISO8601 specification.
ro_ro: O dată/oră conformă cu specificaţia ISO8601.

source: end
ro_ro: sfârşit

source: A date/time conforming to the ISO8601 specification. Can be inferred by supplying a value for start and a duration.
ro_ro: O dată/oră conformă cu specificaţia ISO8601. Poate fi omisă dacă se furnizează o valoare pentru început şi o durată.

source: Compares the current date/time with the start and/or end date, depending on the context. Allowed values:
ro_ro: Compară data/ora curentă cu data de început şi/sau sfârşit, în funcţie de context. Valori permise:

source: gt - True if the current date/time is after start
ro_ro: gt - Adevărat dacă data/ora curentă este după început

source: lt - True if the current date/time is before end
ro_ro: lt - Adevărat dacă data/ora curentă este înainte de sfârşit

source: in-range - True if the current date/time is after start and before end
ro_ro: in-range - Adevărat dacă data/ora curentă este după început şi înainte de sfârşit

source: date-spec - performs a cron-like comparison between the contents of date_spec and now
ro_ro: date-spec - efectuează o comparaţie similară cron-ului între conţinutul date_spec şi acum

source: Because the comparisons (except for <literal>date_spec</literal>) include the time, the <literal>eq, neq, gte</literal> and <literal>lte</literal> operators have not been implemented.
ro_ro: Deoarece comparaţiile (cu excepţia <literal>date_spec</literal>) includ timpul, operatorii <literal>eq, neq, gte</literal> şi <literal>lte</literal> nu au fost implementaţi.

source: Date Specifications
ro_ro: Specificaţiile Datei

source: <literal>date_spec</literal> objects are used to create cron-like expressions relating to time. Each field can contain a single number or a single range. Instead of defaulting to zero, any field not supplied is ignored.
ro_ro: Obiectele <literal>date_spec</literal> sunt folosite pentru a crea expresii similare cu cele create de cron în relaţie cu timpul. Fiecare câmp poate conţine un singur număr sau un singur şir. În loc să aibe valoarea implicită zero, orice câmp a cărui valoare nu este furnizată este ignorat.

source: For example, <literal>monthdays="1"</literal> matches the first day of every month and <literal>hours="09-17"</literal> matches the hours between 9am and 5pm inclusive. However at this time one cannot specify <literal>weekdays="1,2"</literal> or <literal>weekdays="1-2,5-6"</literal> since they contain multiple ranges. Depending on demand, this may be implemented in a future release.
ro_ro: De exemplu, <literal>monthdays="1"</literal> se potriveşte pentru prima zi din fiecare lună şi <literal>hours="09-17"</literal> se potriveşte orelor între 9am şi 5pm inclusiv. Însă la acest moment nu se poate specifica <literal>weekdays="1,2"</literal> sau <literal>weekdays="1-2,5-6"</literal> din moment ce conţin şiruri multiple. În funcţie de cerere, acest aspect ar putea fi implementat într-un release viitor.

source: Properties of a Date Spec
ro_ro: Proprietăţile unei Specificaţii de Dată

source: A unique name for the date
ro_ro: Un nume unic pentru dată

source: Allowed values: 0-23
ro_ro: Valori permise: 0-23

source: Allowed values: 0-31 (depending on current month and year)
ro_ro: Valori permise: 0-31 (în funcţie de luna curentă şi an)

source: Allowed values: 1-7 (1=Monday, 7=Sunday)
ro_ro: Valori permise: 1-7 (1=Luni, 7=Duminică)

source: Allowed values: 1-366 (depending on the current year)
ro_ro: Valori permise: 1-366 (în funcţie de anul curent)

source: Allowed values: 1-12
ro_ro: Valori permise: 1-12

source: Allowed values: 1-53 (depending on weekyear)
ro_ro: Valori permise: 1-53 (în funcţie câte săptămâni are anul)

source: Year according the Gregorian calendar
ro_ro: Anul conform calendarului Gregorian

source: May differ from Gregorian years.
ro_ro: Ar putea fi diferit de anii Gregorieni.

source: Eg. "2005-001 Ordinal" is also "2005-01-01 Gregorian" and is also "2004-W53-6 Weekly"
ro_ro: Ex. "2005-001 Ordinal" este de asemenea "2005-01-01 Gregorian" şi de asemenea "2004-W53-6 Weekly"

source: Allowed values: 0..7 (0 is new, 4 is full moon). Seriously, you can use this. This was implemented to demonstrate the ease with which new comparisons could be added.
ro_ro: Valori permise: 0..7 (0 este pentru lună nouă, 4 pentru pentru lună plină). Nu glumesc, puteţi folosi asta. Acest lucru a fost implementat ca să demonstreze uşurinţa cu care se pot adăuga comparaţii noi.

source: Durations
ro_ro: Durate

source: Durations are used to calculate a value for end when one is not supplied to in_range operations. They contain the same fields as <literal>date_spec</literal> objects but without the limitations (ie. you can have a duration of 19 days). Like <literal>date_specs</literal>, any field not supplied is ignored.
ro_ro: Duratele sunt folosite pentru a calcula valoarea pentru sfârşit atunci când una nu este furnizată în operaţiunile in_range. Acestea conţin aceleaşi câmpuri ca şi obiectele <literal>date_spec</literal> dar fără limitări (ex. puteţi avea o durată de 19 zile). Ca şi în cazul <literal>date_specs</literal>, orice câmp care nu este furnizat este ignorat.

source: Sample Time Based Expressions
ro_ro: Exemple de Expresii Bazate pe Timp

source: True if now is any time in the year 2005
ro_ro: Adevărat dacă acum este oricând în anul 2005

source: Equivalent expression.
ro_ro: Expresie echivalentă.

source: 9am-5pm, Mon-Friday
ro_ro: 9am-5pm, Lun-Vineri

source: 9am-6pm, Mon-Friday, or all day saturday
ro_ro: 9am-6pm, Lun-Vineri sau toată ziua sâmbătă

source: 9am-5pm or 9pm-12pm, Mon-Friday
ro_ro: 9am-5pm sau 9pm-12pm, Lun-Vineri

source: Mondays in March 2005
ro_ro: Zilele de Luni în Martie 2005

source: NOTE: Because no time is specified, 00:00:00 is implied.
ro_ro: NOTĂ: Pentru că nici un timp nu este specificat, 00:00:00 este subînţeles.

source: This means that the range includes all of 2005-03-01 but none of 2005-04-01.
ro_ro: Acest lucru înseamnă că şirul include tot din 2005-03-01 dar nimic din 2005-04-01.

source: You may wish to write end="2005-03-31T23:59:59" to avoid confusion.
ro_ro: Aţi dori să scrieţi end="2005-03-31T23:59:59" pentru a evita confuzia.

source: A full moon on Friday the 13th
ro_ro: O lună plină pe data de Vineri 13

source: Using Rules to Determine Resource Location
ro_ro: Folosind Reguli pentru a Determina Locaţia Resurselor

source: If the constraint's outer-most rule evaluates to false, the cluster treats the constraint as if it was not there. When the rule evaluates to true, the node's preference for running the resource is updated with the score associated with the rule.
ro_ro: Dacă regula cea mai exterioară a unei restricţii este evaluată la fals, clusterul se poartă cu restricţia ca şi cum nu ar fi fost acolo. Când regula este evaluată ca adevărat, preferinţa nodului pentru rularea resursei este actualizată cu scorul asociat cu această regulă.

source: If this sounds familiar, its because you have been using a simplified syntax for location constraint rules already. Consider the following location constraint:
ro_ro: Dacă acest lucru sună cunoscut, este datorită faptului că deja folosiţi o sintaxă simplificată pentru regulile de restricţie a locaţiei. Consideraţi următoarea restricţie de locaţie:

source: Prevent myApacheRsc from running on c001n03
ro_ro: Împiedică myApacheRsc de a rula pe c001n03

source: This constraint can be more verbosely written as:
ro_ro: Aceaastă restricţie poate fi scrisă mai elaborat ca:

source: Prevent myApacheRsc from running on c001n03 - expanded version
ro_ro: Împiedică myApacheRsc de a rula pe c001n03 - versiunea extinsă

source: The advantage of using the expanded form is that one can then add extra clauses to the rule, such as limiting the rule such that it only applies during certain times of the day or days of the week (this is discussed in subsequent sections).
ro_ro: Avantajul folosirii formei extinse este că se pot adăuga clauze suplimentare la regulă, cum ar fi limitarea regulii astfel încât să se aplice doar în momente specifice ale zilei sau zilelor săptămânii (acest lucru este discutat în secţiunile următoare).

source: It also allows us to match on node properties other than its name. If we rated each machine's CPU power such that the cluster had the following nodes section:
ro_ro: Este folosit de asemenea pentru a realiza potriviri pe proprietăţi ale nodului altele decât numele acestuia. Dacă am apreciat puterea procesorului fiecărei maşini astfel încât clusterul să aibe următoarea secţiune de noduri:

source: A sample nodes section for use with score-attribute
ro_ro: Un exemplu de secţiune de noduri pentru utilizarea cu score-attribute

source: then we could prevent resources from running on underpowered machines with the rule
ro_ro: atunci am putea împiedica resursele de a rula pe maşini fără nivelul de procesare cerut cu această regulă

source: Using <literal>score-attribute</literal> Instead of <literal>score</literal>
ro_ro: Folosind <literal>score-attribute</literal> în loc de <literal>score</literal>

source: When using score-attribute instead of score, each node matched by the rule has its score adjusted differently, according to its value for the named node attribute. Thus in the previous example, if a rule used <literal>score-attribute="cpu_mips"</literal>, c001n01 would have its preference to run the resource increased by 1234 whereas c001n02 would have its preference increased by 5678.
ro_ro: Când folosim score-attribute în loc de score, fiecare nod care se potriveşte regulii va avea scorul acestuia ajustat în mod diferit, în funcţie de valoarea sa pentru atributul numit de nod. Prin urmare în exemplul anterior, dacă o regulă folosea <literal>score-attribute="cpu_mips"</literal>, c001n001 ar avea preferinţa proprie de a rula resursa crescută cu 1234 în timp ce c001n02 ar avea preferinţa crescută cu 5678.

source: Using Rules to Control Resource Options
ro_ro: Folosind Reguli pentru a Controla Opţiunile Resurselor

source: Often some cluster nodes will be different from their peers, sometimes these differences (the location of a binary or the names of network interfaces) require resources be configured differently depending on the machine they're hosted on.
ro_ro: Adeseori unele noduri din cluster vor fi diferite de altele, câteodată aceste diferenţe (locaţia unui binar sau numele interfeţelor de reţea) necesită ca şi resursele să fie configurate diferit în funcţie de maşina pe care sunt găzduite.

source: By defining multiple <literal>instance_attributes</literal> objects for the resource and adding a rule to each, we can easily handle these special cases.
ro_ro: Prin definirea de obiecte multiple <literal>instance_attributes</literal> pentru resursă şi prin adăugarea unei reguli pentru fiecare, putem gestiona facil aceste cazuri speciale.

source: In the example below, mySpecialRsc will use eth1 and port 9999 when run on node1, eth2 and port 8888 on node2 and default to eth0 and port 9999 for all other nodes.
ro_ro: În exemplul de mai jos, mySpecialRsc va folosi eth1 şi portul 9999 când va rula pe node1, eth2 şi portul 8888 pe node2 şi va avea valorea implicită eth0 şi portul 9999 pentru toate celelalte noduri.

source: Defining different resource options based on the node name
ro_ro: Definirea de opţiuni de resursă diferite pe baza numelui nodului

source: The order in which <literal>instance_attributes</literal> objects are evaluated is determined by their score (highest to lowest). If not supplied, score defaults to zero and objects with an equal score are processed in listed order. If the <literal>instance_attributes</literal> object does not have a <literal>rule</literal> or has a <literal>rule</literal> that evaluates to <literal>true</literal>, then for any parameter the resource does not yet have a value for, the resource will use the parameter values defined by the <literal>instance_attributes</literal> object.
ro_ro: Ordinea în care obiectele <literal>instance_attributes</literal> sunt evaluate este determinată de către scorul acestora (cel mai mare la cel mai mic). Dacă nu este furnizat, scorul va avea valoarea implicită zero şi obiectele cu un scor egal sunt procesate în ordinea listată. Dacă obiectul <literal>instance_attributes</literal> nu are o <literal>rule</literal> sau are o <literal>rule</literal> care este evaluată la <literal>true</literal>, atunci pentru orice parametru pentru care resursa nu are înca o valoare, resursa va folosi valorile parametrilor definite de obiectul <literal>instance_attributes</literal>.

source: Using Rules to Control Cluster Options
ro_ro: Folosind Reguli pentru a Controla Opţiunile Clusterului

source: Controlling cluster options is achieved in much the same manner as specifying different resource options on different nodes.
ro_ro: Controlarea opţiunilor clusterului este reuşită în mare parte prin aceeaşi manieră ca şi specificarea diverselor opţiuni pentru resurse pe noduri diferite.

source: The difference is that because they are cluster options, one cannot (or should not because they won't work) use attribute based expressions. The following example illustrates how to set a different <literal>resource-stickiness</literal> value during and outside of work hours. This allows resources to automatically move back to their most preferred hosts, but at a time that (in theory) does not interfere with business activities.
ro_ro: Diferenţa este că din cauza că sunt opţiuni de cluster, nu ar trebui să puteţi (sau nu ar trebui să pentru că acestea nu funcţionează) să folosiţi expresii bazate pe atribute. Următorul exemplu ilustrează cum să setaţi o valoare <literal>instance_attributes</literal> diferită în timpul şi în afara orelor de lucru. Acest lucru permite resurselor să se mute înapoi în mod automat la gazdele cele mai preferate, dar la un moment în care (teoretic) nu interferează cu activităţile de business.

source: Set resource-stickiness=INFINITY Mon-Fri between 9am and 6pm, and resource-stickiness=0 all other times
ro_ro: Setaţi resource-stickiness=INFINITY Lun-Vin între 9am şi 6pm, iar resource-stickiness=0 în restul timpului

source: Ensuring Time Based Rules Take Effect
ro_ro: Asigurarea că Regulile Bazate pe Timp Iau Efect

source: A Pacemaker cluster is an event driven system. As such, it won't recalculate the best place for resources to run in unless something (like a resource failure or configuration change) happens. This can mean that a location constraint that only allows resource X to run between 9am and 5pm is not enforced.
ro_ro: Un cluster Pacemaker este un sistem condus de evenimente. Prin urmare, nu va recalcula cel mai bun loc pentru a rula resursele decât dacă ceva (cum ar fi eşecul unei resurse sau modificarea configuraţiei) se întâmplă. Asta poate însemna că o restricţie a locaţiei care permite resursei X să ruleze numai între 9am şi 5pm nu este aplicată în mod obligatoriu.

source: If you rely on time based rules, it is essential that you set the <literal>cluster-recheck-interval</literal> option. This tells the cluster to periodically recalculate the ideal state of the cluster. For example, if you set <literal>cluster-recheck-interval=5m</literal>, then sometime between 9:00 and 9:05 the cluster would notice that it needs to start resource X, and between 17:00 and 17:05 it would realize it needed to be stopped.
ro_ro: Dacă vă bazaţi pe reguli bazate pe timp, este esenţial să setaţi opţiunea <literal>cluster-recheck-interval</literal>. Aceasta spune clusterului să recalculeze periodic starea ideală a clusterului. De exemplu, dacă setaţi <literal>cluster-recheck-interval=5m</literal>, atunci cândva între 9:00 şi 9:05 clusterul va detecta că trebuie să pornească resursa X, iar între 17:00 şi 17:05 va realiza că trebuie să o oprească.

source: Note that the timing of the actual start and stop actions depends on what else needs to be performed first.
ro_ro: Ţineţi cont că momentul efectiv de pornire şi oprire al acţiunilor depinde de ce alte lucruri trebuie efectuate mai întâi.

source: translator-credits
ro_ro: genericul-traducătorului
