Repository: ClusterLabs/Pacemaker
Catalog: doc/Pacemaker_Explained/*/Ch-Resources.po
Languages: ro_ro

source: An OCF resource with custom timeouts for its implicit actions
ro_ro: O resursă OCF cu intervale customizate pentru acţiunile implicite ale acesteia

source: Multiple Monitor Operations
ro_ro: Operaţiuni de Monitorizare Multiple

source: Provided no two operations (for a single resource) have the same name and interval you can have as many monitor operations as you like. In this way you can do a superficial health check every minute and progressively more intense ones at higher intervals.
ro_ro: Atâta timp cât o pereche de două operaţiuni (pentru o singură resursă) nu au acelaşi nume sau acelaşi interval puteţi avea cât de multe operaţiuni de monitorizare pe cât doriţi. În acest fel puteţi realiza o verificare superficială a stării de sănătate la fiecare minut şi unele progresiv mai intense la intervale mai mari.

source: To tell the resource agent what kind of check to perform, you need to provide each monitor with a different value for a common parameter. The OCF standard creates a special parameter called <envar>OCF_CHECK_LEVEL</envar> for this purpose and dictates that it is <emphasis>made available to the resource agent without the normal <envar>OCF_RESKEY_</envar> prefix</emphasis>.
ro_ro: Pentru a spune agentului ce fel de verificare să efectueze, trebuie să furnizaţi fiecărei operaţiuni monitor o valoare diferită pentru un parametru comun. Standardul OCF creează un parametru special numit <envar>OCF_CHECK_LEVEL</envar> pentru acest scop şi dictează că este <emphasis>făcut disponibil agentului de resursă fără obişnuitul prefix <envar>OCF_RESKEY_</envar> </emphasis>.

source: Whatever name you choose, you can specify it by adding an instance_attributes block to the op tag. Note that it is up to each resource agent to look for the parameter and decide how to use it.
ro_ro: Indiferent de ce nume alegeţi, puteţi să îl specificaţi adăugând un bloc instance_attributes la tag-ul op. Ţineţi cont că acest lucru este datoria fiecărui agent de resursă să verifice dacă parametrul există şi să decidă cum să îl folosească.

source: An OCF resource with two recurring health checks performing different levels of checks
ro_ro: O resursă OCF cu două verificări de sănătate recurente efectuând nivele diferite de verificări

source: Disabling a Monitor Operation
ro_ro: Dezactivarea unei Operaţiuni de Monitorizare

source: The easiest way to stop a recurring monitor is to just delete it. However there can be times when you only want to disable it temporarily. In such cases, simply add <literal>disabled="true"</literal> to the operation's definition.
ro_ro: Cel mai simplu mod de a opri un monitor recurent este să îl ştergeţi. Însă pot exista momente când vreţi doar să îl dezactivaţi temporar. În astfel de cazuri, pur şi simplu adăugaţi <literal>disabled="true"</literal> la definiţia operaţiunii.

source: Example of an OCF resource with a disabled health check
ro_ro: Exemplu de resursă OCF cu o verificare a sănătăţii dezactivată

source: This can be achieved from the command-line by executing
ro_ro: Acest lucru poate fi realizat din linia de comanda executând

source: Once you've done whatever you needed to do, you can then re-enable it with
ro_ro: Odată ce aţi făcut ceea ce aveaţi nevoie să faceţi, îl puteţi reactiva cu

source: translator-credits
ro_ro: genericul-traducătorului
