Repository: ClusterLabs/pacemaker
Catalog: doc/Pacemaker_Explained/*/Ch-Rules.po
Languages: it_it

source: Rules
it_it: Regole

source: Rules can be used to make your configuration more dynamic. One common example is to set one value for resource-stickiness during working hours, to prevent resources from being moved back to their most preferred location, and another on weekends when no-one is around to notice an outage.
it_it: Le regole possono essere utilizzate per rendere la propria configurazione più dinamica. Un esempio comune sta nell'impostare un valore di resource-stickiness durante le ore lavorative, per prevenire che le risorse vengano spostate alla loro posizione preferita, ed un altro nei weekend, quando l'impatto dell'operazione di spostamento non verrà notato.

source: Another use of rules might be to assign machines to different processing groups (using a node attribute) based on time and to then use that attribute when creating location constraints.
it_it: Un'altra regola impostabile potrebbe essere quella di assegnare le macchine a differenti gruppi di processo (utilizzando gli attributi del nodo) basati sulle tempistiche ed utilizzare quindi questi attributi nella creazione delle constraint di tipo location.

source: Each rule can contain a number of expressions, date-expressions and even other rules. The results of the expressions are combined based on the rule&#39;s boolean-op field to determine if the rule ultimately evaluates to true or false. What happens next depends on the context in which the rule is being used.
it_it: Ogni regola può contenere diverse espressioni, espressioni di tipo data ed altre regole. L'esito delle espressione è combinato in base al valore del campo boolean-op per determinare se la regola infine risulta vera o falsa. Quello che accade successivamente dipende dal contesto in cui la regola viene utilizzata.

source: Properties of a Rule
it_it: Proprietà di una regola

source: Field
it_it: Campo

source: Description
it_it: Descrizione

source: Limits the rule to only apply when the resource is in that role. Allowed values: <emphasis>Started</emphasis>, Slave, Master. NOTE: A rule with role=&#34;Master&#34; can not determine the initial location of a clone instance. It will only affect which of the active instances will be promoted.
it_it: Limita l'applicazione della regola a quando la risorsa è nel role indicato. Valori permessi: <emphasis>Started</emphasis>, Slave, Master. NOTA: una regola con role=&#34;Master&#34; non può determinare la posizione iniziale di un'istanza clone. Essa agirà unicamente su quale delle istanze attive verrà promossa.

source: The score to apply if the rule evaluates to &#34;true&#34;. Limited to use in rules that are part of location constraints.
it_it: Il punteggio da applicare se la regola risulta &#34;true&#34;. L'utilizzo è limitato nelle regole che sono parte di constraint di tipo location.

source: The node attribute to look up and use as a score if the rule evaluates to &#34;true&#34;. Limited to use in rules that are part of location constraints.
it_it: L'attributo del nodo da controllare ed utilizzare come punteggio de la regola risulta &#34;true&#34;. L'utilizzo è limitato nelle regole che sono parte di constraint tipo location.

source: How to combine the result of multiple expression objects. Allowed values: <emphasis>and</emphasis>, or
it_it: Come combinare il risultato di oggetti con espressioni multiple. Valori permessi: <emphasis>and</emphasis>, or

source: Node Attribute Expressions
it_it: Espressioni relative agli attributi del nodo

source: Expression objects are used to control a resource based on the attributes defined by a node or nodes. In addition to any attributes added by the administrator, each node has a built-in node attribute called <literal>#uname</literal> that can also be used.
it_it: Gli oggetti espressione sono utilizzati per controllare una risorsa basata sugli attributi definiti da uno o più nodi. In aggiunta a qualsiasi attributo aggiunto dall'amministratore, ogni nodo possiede un attributo predefinito che può essere utilizzato chiamato <literal>#uname</literal>.

source: Properties of an Expression
it_it: Proprietà di un'espressione

source: User supplied value for comparison
it_it: Valore fornito dall'utente per la comparazione

source: The node attribute to test
it_it: L'attributo del nodo da controllare

source: Determines how the value(s) should be tested. Allowed values: integer, <emphasis>string</emphasis>, version
it_it: Determina come i valori devono essere testati. Valori permessi: integer, <emphasis>string</emphasis>, version

source: The comparison to perform. Allowed values:
it_it: Il confronto da effettuare. Valori permessi:

source: lt,- True if the node attribute&#39;s value is less than value
it_it: lt - Vera se l'attributo del nodo è minore del valore

source: gt - True if the node attribute&#39;s value is greater than value
it_it: gt - Vera se l'attributo del nodo è maggiore del valore

source: lte- True if the node attribute&#39;s value is less than or equal to value
it_it: lte - Vera se l'attributo del nodo è minore o uguale al valore

source: gte- True if the node attribute&#39;s value is greater than or equal to value
it_it: gte - Vera se l'attributo del nodo è maggiore o ugulae del valore

source: eq- True if the node attribute&#39;s value is equal to value
it_it: eq - Vera se l'attributo del nodo è uguale al valore

source: ne - True if the node attribute&#39;s value is not equal to value
it_it: ne - Vera se l'attributo del nodo non è uguale al valore

source: defined- True if the node has an the named attribute
it_it: defined - Vera se il nodo possiede l'attributo indicato

source: not_defined- True if the node does not have the named attribute
it_it: not_defined - Vera se il nodo non possiede l'attributo indicato

source: Time/Date Based Expressions
it_it: Espressioni basate su Ora/Data

source: As the name suggests, date_expressions are used to control a resource or cluster option based on the current date/time. They can contain an optional <literal>date_spec</literal> and/or <literal>duration</literal> object depending on the context.
it_it: Come suggerisce il nome, le date_expressions sono utilizzate per contollare una risorsa o un'opzione del cluster in base alla data/ora attuale.

source: Properties of a Date Expression
it_it: Proprietà di un'espressione basata sulla data

source: A date/time conforming to the ISO8601 specification.
it_it: Una data/ora conforme alle specifiche ISO8601.

source: A date/time conforming to the ISO8601 specification. Can be inferred by supplying a value for start and a duration.
it_it: Una data/ora conforme alle specifiche ISO8601. Può essere dedotta fornendo un valore per start e duration.

source: Compares the current date/time with the start and/or end date, depending on the context. Allowed values:
it_it: Confronta la data/ora attuale con la data/ora indicata nei parametri start ed end, dipendentemente dal contesto. Valori permessi:

source: gt - True if the current date/time is after start
it_it: gt - Vera se la data/ora attuale è successiva al valore start

source: lt - True if the current date/time is before end
it_it: lt - Vera se la data/ora attuale è precedente al valore start

source: in-range - True if the current date/time is after start and before end
it_it: in-range - Vera se la data/ora attuale è successiva al valore start e precedente al valore end

source: date-spec - performs a cron-like comparison between the contents of date_spec and now
it_it: date-spec - effettua una comparazione simile a cron tra il contenuto di date_spec e la data/ora attuale.

source: Because the comparisons (except for <literal>date_spec</literal>) include the time, the <literal>eq, neq, gte</literal> and <literal>lte</literal> operators have not been implemented.
it_it: Dato che la comparazione (ad eccezione di <literal>date_spec</literal>) include l'ora, gli operatori <literal>eq, neq, gte</literal> e <literal>lte</literal> non sono stati implementati.

source: Date Specifications
it_it: Dichiarare date

source: <literal>date_spec</literal> objects are used to create cron-like expressions relating to time. Each field can contain a single number or a single range. Instead of defaulting to zero, any field not supplied is ignored.
it_it: gli oggetti di tipo <literal>date_spec</literal> sono utilizzati per creare espressioni simili a quelle cron. Ogi campo contiene un singolo numero ed un singolo range Anziché impostare per default zero, ogni campo non difinito viene ignorato.

source: For example, <literal>monthdays=&#34;1&#34;</literal> matches the first day of every month and <literal>hours=&#34;09-17&#34;</literal> matches the hours between 9am and 5pm inclusive). However at this time one cannot specify <literal>weekdays=&#34;1,2&#34;</literal> or <literal>weekdays=&#34;1-2,5-6&#34;</literal> since they contain multiple ranges. Depending on demand, this may be implemented in a future release.
it_it: Ad esempio, <literal>monthdays=&#34;1&#34;</literal> identificherà il primo giorno di ogni mese e <literal>hours=&#34;09-17&#34;</literal> identificherà le ore tra le 9:00 e le 17:00 incluse. Per via del fatto che sono specificati range multipli è impossibile specificare <literal>weekdays=&#34;1,2&#34;</literal> o <literal>weekdays=&#34;1-2,5-6&#34;</literal>. A seconda della richiesta, questa funzionalità potrebbe essere implementata in futuro.

source: Properties of a Date Spec
it_it: Prorpietà di una specifica data

source: A unique name for the date
it_it: Un nome univoco per la data

source: Allowed values: 0-23
it_it: Valori permessi 0-23

source: Allowed values: 0-31 (depending on current month and year)
it_it: Valori permessi: 0-31 (dipendentemente dall'attuale mese ed anno)

source: Allowed values: 1-7 (1=Monday, 7=Sunday)
it_it: Valori permessi: 1-7 (1=lunedì, 7=domenica)

source: yeardays
it_it: yesterdays

source: Allowed values: 1-366 (depending on the current year)
it_it: Valori permessi: 1-366 (dipendente dall'anno attuale)

source: Allowed values: 1-12
it_it: Valori permessi: 1-12

source: Allowed values: 1-53 (depending on weekyear)
it_it: Valori permessi: 1-53 (dipendentemente dalla settimana dell'anno)

source: Year according the Gregorian calendar
it_it: Anno relativo nel calendario gregoriano

source: May differ from Gregorian years.
it_it: Potrebbe differire dal calendario gregoriano.

source: Eg. &#34;2005-001 Ordinal&#34; is also &#34;2005-01-01 Gregorian&#34; is also &#34;2004-W53-6 Weekly&#34;
it_it: Ad esempio &#34;2005-001 Ordinal&#34; è anche &#34;2005-01-01 Gregorian&#34; è anche &#34;2004-W53-6 Weekly&#34;

source: Allowed values: 0..7 (0 is new, 4 is full moon). Seriously, you can use this. This was implemented to demonstrate the ease with which new comparisons could be added.
it_it: Valori permessi: 0..7 (0 è luna nuova, 4 è luna piena). L'opzione è realmente utilizzabile. E' stata inclusa per dimostrare la facilità con cui è possibile aggiungere le nuove comparazioni.

source: Durations
it_it: Durate

source: Durations are used to calculate a value for end when one is not supplied to in_range operations. They contain the same fields as <literal>date_spec</literal> objects but without the limitations (ie. you can have a duration of 19 days). Like <literal>date_specs</literal>, any field not supplied is ignored.
it_it: Le durate vengono utilizzate per calcolare un valore finale nelle operazioni in_range quando non viene fornito. Essi contengono gli stessi campi degli oggetti <literal>date_spec</literal> ma senza le limitazioni (ad esempio è possibile avere durate da 19 giorni). Come per <literal>date_specs</literal> qualsiasi campo non fornito viene ignorato.

source: Sample Time Based Expressions
it_it: Espressioni temporali di esempio

source: True if now is any time in the year 2005
it_it: Vero se "now" è un qualsiasi momento nell'anno 2005

source: Equivalent expression.
it_it: Espressione equivalente.

source: 9am-5pm, Mon-Friday
it_it: 9:00-17:00, lunedì-venerdì

source: 9am-6pm, Mon-Friday, or all day saturday
it_it: 9:00-18:00, lunedì-venerdì, o qualsiasi ora di sabato

source: 9am-5pm or 9pm-12pm, Mon-Friday
it_it: 9:00-17:00 o 21:00-24:00, lunedì-venerdì

source: Mondays in March 2005
it_it: Tutti i lunedì del mese di marzo 2005

source: NOTE: Because no time is specified, 00:00:00 is implied.
it_it: NOTA: visto che non è stato specificato un orario, 00:00:00 è implicito.

source: This means that the range includes all of 2005-03-01 but none of 2005-04-01.
it_it: Questo significa che il range include tutto il 03/01/2005 ma nulla del 04/01/2005

source: You may wish to write end=&#34;2005-03-31T23:59:59&#34; to avoid confusion.
it_it: portrebbe essere necessario inserire end=&#34;2005-03-31T23:59:59&#34; per non creare confusione.

source: A full moon on Friday the 13th
it_it: In luna piena di venerdì 13

source: Using Rules to Determine Resource Location
it_it: Utilizzare regole per determinare il posizionamento delle risorse

source: If the constraint&#39;s outer-most rule evaluates to false, the cluster treats the constraint as if it was not there. When the rule evaluates to true, the node&#39;s preference for running the resource is updated with the score associated with the rule.
it_it: Se il valore della regola constraint è falso il cluster tratta la constraint come non ci fosse.Quando la regola viene valorizzata a vero la preferenza per l'erogazione della risorsa da parte del nodo viene aggiornata con il valore associato alla regola.

source: If this sounds familiar, its because you have been using a simplified syntax for location constraint rules already. Consider the following location constraint:
it_it: Se questo suona familiare è perché sono state già utilizzate sintassi semplificate per le constraint di tipo location. Considerata la seguente location constraint:

source: Prevent myApacheRsc from running on c001n03
it_it: Impedisci a myApacheRsc di essere eseguita su c001n03

source: This constraint can be more verbosely written as:
it_it: Questa constraint potrebbe essere scritta più verbosamente come:

source: Prevent myApacheRsc from running on c001n03 - expanded version
it_it: Impedisci a myApacheRsc di essere eseguita su c001n03 - versione estesa

source: The advantage of using the expanded form is that one can then add extra clauses to the rule, such as limiting the rule such that it only applies during certain times of the day or days of the week (this is discussed in subsequent sections).
it_it: Il vantaggio di usare la versione estesa risiede nel fatto che è possibile aggiungere clausole extra nella regola, come limitarla affinché venga applicata solo in determinati orari del giorno o giorni sella settimana (il tema viene affrontato nelle sezioni sottostanti).

source: It also allows us to match on node properties other than its name. If we rated each machine&#39;s CPU power such that the cluster had the following nodes section:
it_it: Ciò permette di identificare proprietà del nodo diverse dal suo nome. Se per ogni macchina viene quantificata una potenza di CPU così che il cluster abbia la seguente sezione nodi:

source: A sample nodes section for use with score-attribute
it_it: Una sezione nodi di esempio da utilizzare con score-attribute

source: then we could prevent resources from running on underpowered machines with the rule
it_it: allora è possibile prevenire le risorse dall'essere eseguite in macchine meno potenti, mediante la regola

source: Using <literal>score-attribute</literal> Instead of <literal>score</literal>
it_it: Utilizzo di <literal>score-attribute</literal> invece di <literal>score</literal>

source: When using score-attribute instead of score, each node matched by the rule has its score adjusted differently, according to its value for the named node attribute. Thus in the previous example, if a rule used <literal>score-attribute=&#34;cpu_mips&#34;</literal>, c001n01 would have its preference to run the resource increased by 1234 whereas c001n02 would have its preference increased by 5678.
it_it: Quando viene utilizzato score-attribute anziché score, per ogni nodo identificato dalla regola viene calcolato il punteggio in maniera differente, in base al valore dell'attributo definito nel nodo. Quindi nell'esempio precedente, nella regola <literal>score-attribute=&#34;cpu_mips&#34;</literal>, la possibilità di erogare la risorsa per il nodo c001n01 verrà incrementata di 1234 mentre per il nodo c001n02 verrà incrementata di 5678.

source: Using Rules to Control Resource Options
it_it: Utilizzare regole per controllare le opzioni delle risorse

source: Often some cluster nodes will be different from their peers, sometimes these differences (the location of a binary or the names of network interfaces) require resources be configured differently depending on the machine they&#39;re hosted on.
it_it: Può capitare che alcuni nodi del cluster siano differenti fra loro, tali differenze (la posizione di alcuni file o i nomi delle interfacce di rete) a volte impongono configurazioni differenti, dipendenti dalla macchina su cui risiedono.

source: By defining multiple <literal>instance_attributes</literal> objects for the resource and adding a rule to each, we can easily handle these special cases.
it_it: E' possibile gestire facilmente questi casi speciali definendo oggetti <literal>instance_attributes</literal> multipli per le risorse ed aggiungendo una regola per ognuno.

source: In the example below, mySpecialRsc will use eth1 and port 9999 when run on node1, eth2 and port 8888 on node2 and default to eth0 and port 9999 for all other nodes.
it_it: Nell'esempio sottostante mySpecialRsc utilizzerà eth1 e la porta 9999 per funzionare su node1, mentre eth2 e la porta 8888 su node2. Per tutti gli altri nodi i valori di default saranno eth0 con porta 9999.

source: Defining different resource options based on the node name
it_it: Definire opzioni per le risorse differenti in base al nome del nodo

source: The order in which <literal>instance_attributes</literal> objects are evaluated is determined by their score (highest to lowest). If not supplied, score defaults to zero and objects with an equal score are processed in listed order. If the <literal>instance_attributes</literal> object does not have a <literal>rule</literal> or has a <literal>rule</literal> that evaluates to <literal>true</literal>, then for any parameter the resource does not yet have a value for, the resource will use the parameter values defined by the <literal>instance_attributes</literal> object.
it_it: L'ordine in cui gli oggetti <literal>instance_attributes</literal> sono valutati è determinato dal loro peso (dal più alto al più basso). Se non è fornito il punteggio di default è zero e gli oggetti con lo stesso punteggio vengono processati nell'ordine della lista. Se l'oggetto <literal>instance_attributes</literal> non ha una <literal>rule</literal> o ha una <literal>rule</literal> che risulta in <literal>true</literal>, allora la risorsa non avrà ancora un valore per qualsiasi parametro ed utilizzerà quindi il valore fornito dall'oggetto <literal>instance_attributes</literal>.

source: Using Rules to Control Cluster Options
it_it: Utilizzare le regole per controllare le opzioni del cluster

source: Controlling cluster options is achieved in much the same manner as specifying different resource options on different nodes.
it_it: E' possibile controllare le opzioni del cluster mediante le stesse modalità utilizzate per specificare opzioni differenti per le risorse in nodi differenti.

source: The difference is that because they are cluster options, one cannot (or should not because they wont work) use attribute based expressions. The following example illustrates how to set a different <literal>resource-stickiness</literal> value during and outside of work hours. This allows resources to automatically move back to their most preferred hosts, but at a time that (in theory) does not interfere with business activities.
it_it: La differenza è che queste sono opzioni del cluster e non è possibile (o non dovrebbe esserlo, visto che non funzionerebbe) utilizzare espressioni basate sugli attributi. L'esempio seguente illustra come settare un valore differente di <literal>resource-stickiness</literal> in un periodo di tempo lontano dalle ore lavorative. Ciò permette alle risorse di tornare sugli host preferiti in orari che (in teoria) non interferiscono con le attività produttive.

source: Set resource-stickiness=INFINITY Mon-Fri between 9am and 6pm, and resource-stickiness=0 all other times
it_it: Imposta resource-stickiness=INFINITY dal lunedì al venerdì tra le 9:00 e le 18:00 e resource-stickiness=0 per tutti gli altri orari

source: Ensuring Time Based Rules Take Effect
it_it: Assicurarsi che le regole basate sugli orari abbiano effetto

source: A Pacemaker cluster is an event driven system. As such, it wont recalculate the best place for resources to run in unless something (like a resource failure or configuration change) happens. This can mean that a location constraint that only allows resource X to run between 9am and 5pm is not enforced.
it_it: Un cluster Pacemaker è un sistema guidato dagli eventi. Per via di questo, non ricalcolerà il posto migliore per una risorsa a meno che non succeda qualcosa (come un problema o una variazione nella configurazione). Questo può significare che una location constraint che permetta il funzionamento tra le 9:00 e le 17:00 della risorsa X possa non essere forzata.

source: If you rely on time based rules, it is essential that you set the <literal>cluster-recheck-interval</literal> option. This tells the cluster to periodically recalculate the ideal state of the cluster. For example, if you set <literal>cluster-recheck-interval=5m</literal>, then sometime between 9:00 and 9:05 the cluster would notice that it needs to start resource X, and between 17:00 and 17:05 it would realize it needed to be stopped.
it_it: Se ci si basa sulle regole orarie, è essenziale impostare l'opzione <literal>cluster-recheck-interval</literal>. Questo comunica al cluster di ricalcolare periodicamente il suo stato. Ad esempio, se viene impostato <literal>cluster-recheck-interval=5m</literal>, allora in qualche momento tra le 9:00 e le 9:05 il cluster rileverà la necessità di avviare la risorsa X e tra le 17:00 e le 17:05 rileverà di doverla fermare.

source: Note that the timing of the actual start and stop actions depends on what else needs to be performed first.
it_it: E' da notare come le tempistiche delle azioni di start e stop dipendono da quanto altro necessita di essere eseguito prima.
