Repository: ClusterLabs/Pacemaker
Catalog: doc/Pacemaker_Explained/*/Ch-Status.po
Languages: ro_ro

source: Status - Here be dragons
ro_ro: Status - Aici sunt dragoni

source: Most users never need understand the contents of the status section and can be content with the output from <command>crm_mon</command>. However for those with a curious inclination, the following attempts to provide an overview of its contents.
ro_ro: Majoritatea utilizatorilor nu trebuie niciodată să înţeleagă conţinutul secţiunii de status şi se pot mulţumi cu rezultatul de ieşire de la <command>crm_mon</command>. Totuşi pentru aceia dintre voi cu o înclinaţie către curiozitate, următoarele încearcă să furnizeze o vedere de ansamblu asupra conţinutului acestuia.

source: Node Status
ro_ro: Status-ul Nodului

source: In addition to the cluster's configuration, the CIB holds an up-to-date representation of each cluster node in the status section.
ro_ro: În plus faţă de configuraţia clusterului, CIB-ul menţine o reprezentare cât mai actualizată a fiecărui nod din cluster în secţiunea de status.

source: A bare-bones status entry for a healthy node called cl-virt-1
ro_ro: O intrare iniţială de status pentru un nod sănătos numit cl-virt-1

source: Users are highly recommended <emphasis>not to modify</emphasis> any part of a node's state <emphasis>directly</emphasis>. The cluster will periodically regenerate the entire section from authoritative sources. So any changes should be with the tools for those subsystems.
ro_ro: Utilizatorilor li se recomandă stringent <emphasis>să nu modifice</emphasis> nici o parte din starea nodului <emphasis>în mod direct</emphasis>. Clusterul va regenera periodic întreaga secţiune din surse autoritative. Aşa că orice modificare ar trebui executată cu utilitarele pentru acele subsisteme.

source: Authoritative Sources for State Information
ro_ro: Surse Autoritative pentru Informaţia de Stare

source: Authoritative Source
ro_ro: Sursă Autoritativă

source: node_state fields
ro_ro: câmpurile node_state

source: transient_attributes tag
ro_ro: tag-ul transient_attributes

source: lrm tag
ro_ro: tag-ul lrm

source: The fields used in the <literal>node_state</literal> objects are named as they are largely for historical reasons and are rooted in Pacemaker's origins as the Heartbeat resource manager. They have remained unchanged to preserve compatibility with older versions.
ro_ro: Câmpurile folosite în obiectele <literal>node_state</literal> sunt denumite aşa cum sunt în mare parte din motive istorice şi sunt înrădăcinate în originile Pacemaker-ului ca manager de resurse pentru Heartbeat. Acestea au rămas neschimbate pentru a păstra compatibilitatea cu versiuni mai vechi.

source: Node Status Fields
ro_ro: Câmpuri de Status ale Nodului

source: Field
ro_ro: Câmp

source: Description
ro_ro: Descriere

source: Unique identifier for the node. Corosync based clusters use the same value as uname, Heartbeat cluster use a human-readable (but annoying) UUID.
ro_ro: Identificator unic pentru nod. Clusterele bazate pe Corosync folosesc aceeaşi valoare ca uname, clusterele Heartbeat folosesc un UUID în format uşor de citit de oameni (dar enervant).

source: The node's machine name (output from uname -n)
ro_ro: Numele nodului (rezultat din uname -n)

source: Is the cluster software active on the node. Allowed values: active, dead
ro_ro: Este soft-ul de cluster activ pe nod? Valori permise: active, dead

source: Is the node part of the cluster's membership. Allowed values: true, false
ro_ro: Este nodul parte din apartenenţa clusterului. Valori permise: true, false

source: Is the crmd process active on the node. Allowed values: online, offline
ro_ro: Este procesul crmd activ pe nod. Valori permise: online, offline

source: Is the node participating in hosting resources. Allowed values: down, pending, member, banned
ro_ro: Participă nodul în găzduirea de resurse. Valori permise: down, pending, member, banned

source: Expected value for join
ro_ro: Valoarea aşteptată pentru join

source: Diagnostic indicator. The origin of the most recent change(s).
ro_ro: Indicator de diagnostic. Originea celei mai recente schimbări.

source: The cluster uses these fields to determine if, at the node level, the node is healthy or is in a failed state and needs to be fenced.
ro_ro: Clusterul foloseşte aceste câmpuri ca să determine dacă, la nivel de nod, nodul este sănătos sau este într-o stare defectuoasă şi trebuie evacuat.

source: Transient Node Attributes
ro_ro: Atribute Tranziente ale Nodului

source: Like regular <link linkend="s-node-attributes">node attributes</link>, the name/value pairs listed here also help describe the node. However they are forgotten by the cluster when the node goes offline. This can be useful, for instance, when you only want a node to be in standby mode (not able to run resources) until the next reboot.
ro_ro: Precum <link linkend="s-node-attributes">atributele nodului</link> obişnuite, perechile nume/valoare listate aici ajută de asemenea la descrierea nodului. Totuşi acestea sunt uitate de către cluster atunci când nodul trece în mod offline. Acest lucru poate fi util, de exemplu, când vreţi un nod să se afle în mod standby (să nu poată rula resurse) până la următorul reboot.

source: In addition to any values the administrator sets, the cluster will also store information about failed resources here.
ro_ro: În plus faţă de orice valori setează administratorul, clusterul va stoca de asemenea informaţii despre resursele eşuate aici.

source: Example set of transient node attributes for node "cl-virt-1"
ro_ro: Exemplu de atribute tranziente de nod pentru nodul "cl-virt-1"

source: You can use the following Perl one-liner to print a human readable of any seconds-since-epoch value:
ro_ro: Puteţi folosi umătorul one-liner Perl pentru a printa o valoare a secundelor-de-la-epoch în format uşor de citit pentru oameni.

source: In the above example, we can see that the pingd:0 resource has failed once, at <literal>Mon Apr 6 11:22:22 2009</literal>. <placeholder-1/> We also see that the node is connected to three "pingd" peers and that all known resources have been checked for on this machine (<literal>probe_complete</literal>).
ro_ro: În exemplul de mai sus, putem vedea că resursa pingd:0 a eşuat o dată, pe <literal>Mon Apr 6 11:22:22 2009</literal>. <placeholder-1/> Observăm de asemenea că nodul este conectat la trei vecini "pingd" şi că toate resursele cunoscute au fost verificate pe această maşină (<literal>probe_complete</literal>).

source: Operation History
ro_ro: Istoricul Operaţiilor

source: A node's resource history is held in the <literal>lrm_resources</literal> tag (a child of the lrm tag). The information stored here includes enough information for the cluster to stop the resource safely if it is removed from the <literal>configuration</literal> section. Specifically we store the resource's <literal>id, class, type</literal> and <literal>provider</literal>.
ro_ro: Istoricul resurselor unui nod este ţinut în tag-ul <literal>lrm_resources</literal> (un copil al tag-ului lrm). Informaţia stocată aici include destulă informaţie pentru ca şi clusterul să oprească resursa în siguranţă dacă este îndepărtată din secţiunea de <literal>configurare</literal>. În mod specific stocăm <literal>id, class, type</literal> şi <literal>provider-ul</literal> resursei.

source: A record of the apcstonith resource
ro_ro: O înregistrare a resursei apcstonith

source: Additionally, we store the last job for every combination of <literal>resource, action</literal> and <literal>interval</literal>. The concatenation of the values in this tuple are used to create the id of the <literal>lrm_rsc_op</literal> object.
ro_ro: Suplimentar, stocăm ultimul job pentru fiecare combinaţie de <literal>resource, action</literal> şi <literal>interval</literal>. Concatenarea valorilor din această tuplă este folosită pentru a crea id-ul obiectului <literal>lrm_rsc_op</literal>.

source: Contents of an lrm_rsc_op job.
ro_ro: Conţinutul unui job lrm_rsc_op.

source: Identifier for the job constructed from the resource id, operation and interval.
ro_ro: Identificatorul pentru job construit din id-ul resursei, operaţiunii şi intervalului.

source: The job's ticket number. Used as a sort key to determine the order in which the jobs were executed.
ro_ro: Numărul tichetului job-ului. Folosit ca şi cheie de sortare pentru a determina ordinea în care job-urile au fost executate.

source: operation
ro_ro: operaţiune

source: The action the resource agent was invoked with.
ro_ro: Acţiunea cu care a fost invocat agentul de resursă.

source: The frequency, in milliseconds, at which the operation will be repeated. 0 indicates a one-off job.
ro_ro: Frecvenţa, în milisecunde, la care va fi repetată operaţiunea. 0 indică un job unicat.

source: The job's status. Generally this will be either 0 (done) or -1 (pending). Rarely used in favor of rc-code.
ro_ro: Status-ul job-ului. În general acesta va fi ori 0 (completat) ori -1 (în aşteptare). Rareori folosit în favoarea a rc-code.

source: The job's result. Refer to <xref linkend="s-ocf-return-codes"/> for details on what the values here mean and how they are interpreted.
ro_ro: Rezultatul job-ului. Faceţi referire la <xref linkend="s-ocf-return-codes"/> pentru detalii despre ce înseamnă valorile de aici şi cum sunt interpretate.

source: Diagnostic indicator. Machine local date/time, in seconds since epoch, at which the job was executed.
ro_ro: Indicator de diagnostic. Ora/data locală a maşinii, în secunde de la epocă, la care job-ul a fost executat.

source: Diagnostic indicator. Machine local date/time, in seconds since epoch, at which the job first returned the current value of rc-code
ro_ro: Indicator de diagnostic. Ora/data locală a maşinii, în secunde de la epocă, la care job-ul a returnat prima oară valoarea rc-code

source: Diagnostic indicator. Time, in milliseconds, that the job was running for
ro_ro: Indicator de diagnostic. Timpul, în milisecunde, pentru care a rulat job-ul

source: Diagnostic indicator. Time, in seconds, that the job was queued for in the LRMd
ro_ro: Indicator de diagnostic. Timpul, în secunde, pentru care a fost pus job-ul în coada de aşteptare în LRMd

source: The version which this job description conforms to. Used when processing op-digest
ro_ro: Versiunea la care se conformează această descriere a job-ului. Folosită când se procesează op-digest

source: A concatenation of the job's graph action number, the graph number, the expected result and the UUID of the crmd instance that scheduled it. This is used to construct transition-magic (below).
ro_ro: O concatenare a numărului de acţiune al grafului job-ului, numărul grafului, rezultatul aşteptat şi UUID-ul instanţei de crmd care l-a programat. Acesta este folosit pentru a construi magica-tranziţiei (mai jos).

source: A concatenation of the job's op-status, rc-code and transition-key. Guaranteed to be unique for the life of the cluster (which ensures it is part of CIB update notifications) and contains all the information needed for the crmd to correctly analyze and process the completed job. Most importantly, the decomposed elements tell the crmd if the job entry was expected and whether it failed.
ro_ro: O concatenare a op-status-ului job-ului, rc-code-ului şi a transition-key. Garantat să fie unic pe perioada vieţii clusterului (fapt care asigură ca este parte din notificările de actualizări ale CIB-ului) şi conţine toată informaţia necesară ca şi crmd-ul să analizeze şi să proceseze corect job-ul terminat. Cel mai important, elementele descompuse îi spun crmd-ului dacă intrarea pentru job era aşteptată şi dacă aceasta a eşuat.

source: An MD5 sum representing the parameters passed to the job. Used to detect changes to the configuration and restart resources if necessary.
ro_ro: Un hash MD5 reprezentând parametrii trimişi job-ului. Folosit pentru a detecta schimbările în configuraţie şi a reporni resursele dacă este necesar.

source: Diagnostic indicator. The origin of the current values.
ro_ro: Indicator de diagnostic. Originea valorilor curente.

source: Simple Example
ro_ro: Exemplu Simplu

source: A monitor operation performed by the cluster to determine the current state of the apcstonith resource
ro_ro: O operaţiune de monitorizare efectuată de către cluster pentru a determina starea curentă a resursei apcstonith.

source: In the above example, the job is a non-recurring monitor often referred to as a "probe" for the apcstonith resource. The cluster schedules probes for every configured resource on when a new node starts, in order to determine the resource's current state before it takes further any further action.
ro_ro: În exemplul de mai sus, job-ul este un monitor non-recurent adeseori făcută referire la acesta sub numele de "probă" pentru resursa apcstonith. Clusterul programează probe pentru fiecare resursă configurată când un nou nod porneşte, în vederea determinării stării curente a resursei înainte de a urma orice acţiune ulterioară.

source: From the <literal>transition-key</literal>, we can see that this was the 22nd action of the 2nd graph produced by this instance of the crmd (2668bbeb-06d5-40f9-936d-24cb7f87006a). The third field of the <literal>transition-key</literal> contains a 7, this indicates that the job expects to find the resource inactive. By now looking at the rc-code property, we see that this was the case.
ro_ro: Din <literal>transition-key</literal>, putem să vedem că aceasta a fost a 22-a acţiune a celui de-al 2-lea graf produs de această instanţă a crmd-ului (2668bbeb-06d5-40f9-936d-24cb7f87006a). Al treilea câmp al <literal>transition-key</literal> conţine un 7, acest lucru indică faptul că job-ul se aşteaptă să găsească resursa inactivă. Uitându-ne acum la proprietatea rc-code, putem vedea că aşa a şi fost.

source: Evidently, the cluster started the resource elsewhere as that is the only job recorded for this node.
ro_ro: În mod evident, clusterul a pornit resursa în altă parte din moment ce acesta este singurul job înregistrat pentru acest nod.

source: Complex Resource History Example
ro_ro: Exemplu Complex de Istoric al Resurselor

source: Resource history of a pingd clone with multiple jobs
ro_ro: Istoricul resurselor unei clone pingd cu job-uri multiple

source: When more than one job record exists, it is important to first sort them by <literal>call-id</literal> before interpret them. Once sorted, the above example can be summarized as:
ro_ro: Când există mai mult de o singură înregistrare a unui job, este important mai întâi să le sortăm după <literal>call-id</literal> înainte de a le interpreta. Odată sortate, exemplul de mai sus poate fi sumarizat ca:

source: A non-recurring monitor operation returning 7 (not running), with a call-id of 3
ro_ro: O operaţiune non-recurentă de monitorizare returnează 7 (nu rulează), cu un call-id de 3

source: A stop operation returning 0 (success), with a call-id of 32
ro_ro: O operaţiune de oprire returnează 0 (succes), cu un call-id de 32

source: A start operation returning 0 (success), with a call-id of 33
ro_ro: O operaţiune de pornire returnează 0 (succes), cu un call-id de 33

source: A recurring monitor returning 0 (success), with a call-id of 34
ro_ro: Un monitor recurent returnează 0 (succes), cu un call-id de 34

source: The cluster processes each job record to build up a picture of the resource's state. After the first and second entries, it is considered stopped and after the third it considered active. Based on the last operation, we can tell that the resource is currently active.
ro_ro: Clusterul procesează fiecare înregistrare a unui job pentru a construi o imagine asupra stării resursei. După prima şi a doua intrare, este considerată oprită şi după a treia este considerată activă. Pe baza ultimelor operaţiuni, putem spune că resursa este activă în mod curent.

source: Additionally, from the presence of a <literal>stop</literal> operation with a lower <literal>call-id</literal> than that of the <literal>start</literal> operation, we can conclude that the resource has been restarted. Specifically this occurred as part of actions 11 and 31 of transition 11 from the crmd instance with the key <literal>2668bbeb-06d5-40f9-936d-24cb7f87006a</literal>. This information can be helpful for locating the relevant section of the logs when looking for the source of a failure.
ro_ro: Suplimentar, din prezenţa unei operaţiuni de <literal>oprire</literal> cu un <literal>call-id</literal> mai mic decât cel al operaţiunii <literal>start</literal>, putem concluziona că resursa a fost repornită. În mod specific acest lucru s-a întâmplat ca parte a acţiunilor 11 şi 31 ale tranziţiei 11 de la instanţa crmd cu cheia <literal>2668bbeb-06d5-40f9-936d-24cb7f87006a</literal>. Această informaţie poate fi utilă pentru localizarea secţiunii relevante din loguri când căutaţi sursa unei defecţiuni.

source: translator-credits
ro_ro: genericul-traducătorului
