Repository: ClusterLabs/pacemaker
Catalog: doc/Clusters_from_Scratch/*/Ch-Active-Active.po
Languages: ro_ro

source: Conversion to Active/Active
ro_ro: Conversia la Activ/Activ

source: Requirements
ro_ro: Cerințe

source: The primary requirement for an Active/Active cluster is that the data required for your services is available, simultaneously, on both machines. Pacemaker makes no requirement on how this is achieved, you could use a SAN if you had one available, however since DRBD supports multiple Primaries, we can also use that.
ro_ro: Cerința primară pentru un cluster Activ/Activ este ca datele necesare pentru serviciile voastre să fie disponibile, în mod simultan, pe ambele mașini. Pacemaker nu face nici o cerință asupra modului în care este atins acest scop, ați putea folosi un SAN dacă ați fi avut unul disponibil, însă din moment ce DRBD suportă noduri multiple Primare, putem să le folosim pe acestea de asemenea.

source: The only hitch is that we need to use a cluster-aware filesystem. The one we used earlier with DRBD, ext4, is not one of those. Both OCFS2 and GFS2 are supported, however here we will use GFS2 which comes with &DISTRO; &DISTRO_VERSION; .
ro_ro: Singura piedică este că avem nevoie de un sistem de fișiere conștient de cluster. Cel folosit anterior cu DRBD, ext4, nu este unul dintre acelea. Atât OCFS2 cât și GFS2 sunt suportate, însă aici vom folosi GFS2 care vine împreună cu &DISTRO; &DISTRO_VERSION;.

source: We'll also need to use CMAN for Cluster Membership and Quorum instead of our Corosync plugin.
ro_ro: Va trebui de asemenea să folosim CMAN pentru Apartenența la Cluster și Quorum în locul plugin-ului nostru de Corosync.

source: Adding CMAN Support
ro_ro: Adăugarea de Suport pentru CMAN

source: <ulink url="http://docs.redhat.com/docs/en-US/Red_Hat_Enterprise_Linux/6/html-single/Cluster_Suite_Overview/index.html#s2-clumembership-overview-CSO">CMAN v3</ulink> is a Corsync plugin that monitors the names and number of active cluster nodes in order to deliver membership and quorum information to clients (such as the Pacemaker daemons).
ro_ro: <ulink url="http://docs.redhat.com/docs/en-US/Red_Hat_Enterprise_Linux/6/html-single/Cluster_Suite_Overview/index.html#s2-clumembership-overview-CSO">CMAN v3</ulink> este un plugin al Corosync care monitorizează numele și numărul de noduri active din cluster pentru a livra informații de apartenență și quorum clienților (cum ar fi daemonii Pacemaker).

source: In a traditional Corosync-Pacemaker cluster, a Pacemaker plugin is loaded to provide membership and quorum information. The motivation for wanting to use CMAN for this instead, is to ensure all elements of the cluster stack are making decisions based on the same membership and quorum data. <footnote> <para> A failure to do this can lead to what is called <literal>internal split-brain</literal> - a situation where different parts of the stack disagree about whether some nodes are alive or dead - which quickly leads to unnecssary down-time and/or data corruption. </para> </footnote>
ro_ro: Într-un cluster tradițional Corosync-Pacemaker, un plugin Pacemaker este încărcat pentru a furniza informații de apartenență și quorum. Motivația pentru a dori folosirea CMAN în schimb pentru acest lucru, este de a asigura că toate elementele stivei de cluster realizează decizii bazate pe aceleași date de apartenență și quorum. <footnote> <para> Un eșec de a realiza acest lucru poate duce la ceea ce este numit a fi un <literal>split-brain intern</literal> - o situație în care părți diferite ale stivei nu sunt de acord dacă unele noduri sunt funcționale sau nu - fapt care conduce rapid către o nefuncționare inutilă și/sau către coruperea datelor. </para> </footnote>

source: In the case of GFS2, the key pieces are the <filename>dlm_controld</filename> and <filename>gfs_controld</filename> helpers which act as the glue between the filesystem and the cluster software. Supporting CMAN enables us to use the versions already being shipped by most distributions (since CMAN has been around longer than Pacemaker and is part of the Red Hat cluster stack).
ro_ro: În cazul GFS2, componentele cheie sunt ajutoarele <filename>dlm_controld</filename> și <filename>gfs_controld</filename> care se comportă ca o îmbinare între sistemul de fișiere și soft-ul de cluster. Suportarea CMAN ne permite să folosim versiunile deja expediate de către majoritatea distribuțiilor (din moment ce CMAN a fost prin preajmă mai mult timp decât Pacemaker și este totodată parte din stiva de cluster a Red Hat).

source: Ensure Corosync and Pacemaker are stopped <emphasis>on all nodes</emphasis> before continuing
ro_ro: Asigurați-vă că Pacemaker și Corosync sunt oprite <emphasis>pe toate nodurile</emphasis> înainte de a continua

source: Be sure to disable the Pacemaker plugin before continuing with this section. In most cases, this can be achieved by removing <filename>/etc/corosync/service.d/pcmk</filename> and stopping Corosync.
ro_ro: Să vă asigurați că dezactivați plugin-ul de Pacemaker înainte de a continua cu această secțiune. În majoritatea cazurilor, acest lucru poate fi realizat prin înlăturarea <filename>/etc/corosync/service.d/pcmk</filename> și prin oprirea Corosync.

source: Installing the required Software
ro_ro: Instalarea Soft-ului necesar

source: Configuring CMAN
ro_ro: Configurarea CMAN

source: The first thing we need to do, is tell CMAN complete starting up even without quorum. We can do this by changing the quorum timeout setting:
ro_ro: Primul lucru pe care trebuie să îl facem este să îi spunem lui CMAN să încheie cu succes procedura de pornire chiar și fără quorum. Putem realiza acest lucru prin schimbarea setării de expirare a temporizatorului pentru quorum:

source: Next we create a basic configuration file and place it in <filename>/etc/cluster/cluster.conf</filename>. The <constant>name</constant> used for each <constant>clusternode</constant> should correspond to that node's <command>uname -n</command>, just as Pacemaker expects. The <constant>nodeid</constant> can be any positive number but must be unique.
ro_ro: În continuare creem un fișier de configurare de bază și îl punem în <filename>/etc/cluster/cluster.conf</filename>. <constant>Numele</constant> folosit pentru fiecare <constant>clusternode</constant> ar trebui să corespundă cu <command>uname -n</command> de pe nodul respectiv, exact așa cum se așteaptă și Pacemaker. <constant>nodeid</constant> poate fi orice număr pozitiv dar trebuie să fie unic.

source: Basic cluster.conf for a two-node cluster
ro_ro: Un cluster.conf de bază pentru un cluster format din două noduri

source: Configuring CMAN Fencing
ro_ro: Configurarea Evacuării Forțate în CMAN

source: We configure the <filename>fence_pcmk</filename> agent (supplied with Pacemaker) to redirect any fencing requests from CMAN components (such as dlm_controld) to Pacemaker. Pacemaker's fencing subsystem lets other parts of the stack know that a node has been successfully fenced, thus avoiding the need for it to be fenced again when other subsystems notice the node is gone.
ro_ro: Configurăm agentul <filename>fence_pcmk</filename> (furnizat împreună cu Pacemaker) pentru a redirecta orice cereri de evacuare forțată de la componentele CMAN (cum ar fi dlm_controld) către Pacemaker. Subsistemul de evacuare forțată al Pacemaker lasă alte părți ale stivei să știe că un nod a fost evacuat forțat cu succes, prin urmare evitând nevoia ca acesta să fie evacuat forțat din nou când alte subsisteme detectează că nodul a dispărut.

source: Configuring real fencing devices in CMAN will result in nodes being fenced multiple times as different parts of the stack notice the node is missing or failed.
ro_ro: Configurarea de dispozitive reale de evacuare forțată în CMAN va rezulta în evacuarea forțată de mai multe ori a nodurilor pe măsură ce părți diferite ale stivei detectează că un nod lipsește sau a eșuat.

source: The definition should be placed in the <constant>fencedevices</constant> section and contain:
ro_ro: Definiția ar trebui plasată în secțiunea <constant>fencedevices</constant> și ar trebui să conțină:

source: Each <constant>clusternode</constant> must be configured to use this <quote>device</quote> by adding a <constant>fence method</constant> block that lists the node's <constant>name</constant> as the <constant>port</constant>.
ro_ro: Fiecare <constant>clusternode</constant> trebuie să fie configurat să folosească acest <quote>dispozitiv</quote> prin adăugarea unui bloc cu <constant>metoda de evacuare forțată</constant> care listează <constant>numele</constant> acelui nod ca și <constant>port</constant>.

source: Putting everything together, we have:
ro_ro: Punând totul la un loc, avem:

source: cluster.conf for a two-node cluster with fencing
ro_ro: cluster.conf pentru un cluster format din două noduri cu evacuare forțată

source: Bringing the Cluster Online with CMAN
ro_ro: Aducerea Clusterului Online cu CMAN

source: The first thing to do is check that the configuration is valid
ro_ro: Primul lucru care trebuie făcut este de a verifica dacă este validă configurația

source: Now start CMAN
ro_ro: Acum porniți CMAN

source: Once you have confirmed that the first node is happily online, start the second node.
ro_ro: Odată ce ați confirmat că primul nod este fericit online, porniți al doilea nod.

source: You should now see both nodes online and services started.
ro_ro: Ar trebui să vedeți acum ambele noduri online și serviciile pornite.

source: Create a GFS2 Filesystem
ro_ro: Creați un Sistem de Fișiere GFS2

source: Preparation
ro_ro: Pregătire

source: Before we do anything to the existing partition, we need to make sure it is unmounted. We do this by telling the cluster to stop the WebFS resource. This will ensure that other resources (in our case, Apache) using WebFS are not only stopped, but stopped in the correct order.
ro_ro: Înainte de a face orice partiției existente, trebuie să ne asigurăm că este nemontată. Realizăm acest lucru spunând clusterului să oprească resursa WebFS. Acest lucru va asigura că alte resurse (în cazul nostru, Apache) care folosesc WebFS nu sunt doar oprite, ci sunt oprite în ordinea corectă.

source: Note that both Apache and WebFS have been stopped.
ro_ro: Luați aminte că atât Apache cât și WebFS au fost oprite.

source: Create and Populate an GFS2 Partition
ro_ro: Crearea și Popularea unei Partiții GFS2

source: Now that the cluster stack and integration pieces are running smoothly, we can create an GFS2 partition.
ro_ro: Acum că stiva de cluster și componentele de integrare rulează fără piedici, putem crea o partiție GFS2.

source: This will erase all previous content stored on the DRBD device. Ensure you have a copy of any important data.
ro_ro: Această acțiune va șterge tot conținutul stocat anterior pe dispozitivul DRBD. Asigurați-vă că aveți o copie a oricăror date importante.

source: We need to specify a number of additional parameters when creating a GFS2 partition.
ro_ro: Trebuie să specificăm un număr de parametri adiționali când creem o partiție GFS2.

source: First we must use the -p option to specify that we want to use the the Kernel’s DLM. Next we use -j to indicate that it should reserve enough space for two journals (one per node accessing the filesystem).
ro_ro: Întâi trebuie să folosim opțiunea -p pentru a specifica faptul că vrem să folosim DLM-ul Kernel-ului. În continuare folosim -j pentru a indica faptul că trebuie să rezerve destul spațiu pentru două jurnale (unul pentru fiecare nod care accesează sistemul de fișiere).

source: Lastly, we use -t to specify the lock table name. The format for this field is clustername:fsname. For the fsname, we just need to pick something unique and descriptive and since we haven’t specified a clustername yet, we will use the default (pcmk).
ro_ro: În cele din urmă, folosim -t pentru a specifica numele tabelei de blocare. Formatul acestui câmp este clustername:fsname. Pentru fsname, nu trebuie decât să alegem ceva unic și descriptiv și din moment ce nu am specificat un clustername încă, vom folosi valoarea implicită (pcmk).

source: To specify an alternate name for the cluster, locate the service section containing "name: pacemaker" in corosync.conf and insert the following line anywhere inside the block:
ro_ro: Pentru a specifica un nume alternativ pentru cluster, localizați secțiunea service din corosync.conf care conține "name: pacemaker" și inserați următoarea linie oriunde înăuntrul acelui bloc.

source: Do this on each node in the cluster and be sure to restart them before continuing.
ro_ro: Realizați acest lucru pe fiecare nod din cluster și asigurați-vă că le-ați repornit înainte de a continua.

source: Then (re)populate the new filesystem with data (web pages). For now we’ll create another variation on our home page.
ro_ro: Apoi (re)populați noul sistem de fișiere cu date (pagini web). Momentan vom crea o nouă variație pe pagina noastră principală.

source: Reconfigure the Cluster for GFS2
ro_ro: Reconfigurarea Clusterului pentru GFS2

source: Now that we’ve recreated the resource, we also need to recreate all the constraints that used it. This is because the shell will automatically remove any constraints that referenced WebFS.
ro_ro: Acum că am creat resursa, trebuie să recreem și toate restricțiile care o foloseau. Acest lucru este datorită faptului că shell-ul va înlătura în mod automat orice restricție care referențiază WebFS..

source: Review the configuration before uploading it to the cluster, quitting the shell and watching the cluster’s response
ro_ro: Revizuiți configurația înainte de a o încărca pe cluster, părăsind shell-ul și urmărind răspunsul clusterului

source: Reconfigure Pacemaker for Active/Active
ro_ro: Reconfigurarea Pacemaker pentru Activ/Activ

source: Almost everything is in place. Recent versions of DRBD are capable of operating in Primary/Primary mode and the filesystem we’re using is cluster aware. All we need to do now is reconfigure the cluster to take advantage of this.
ro_ro: Aproape totul este la locul său. Versiunile recente de DRBD sunt capabile să opereze în mod Primar/Primar și sistemul de fișiere pe care îl folosim este conștient de cluster. Tot ce trebuie să facem aum este să reconfigurăm clusterul pentru a profita de acest lucru.

source: This will involve a number of changes, so we’ll again use interactive mode.
ro_ro: Acest lucru va implica un număr de modificări, așa că vom folosi din nou modul interactiv.

source: There’s no point making the services active on both locations if we can’t reach them, so lets first clone the IP address. Cloned IPaddr2 resources use an iptables rule to ensure that each request only gets processed by one of the two clone instances. The additional meta options tell the cluster how many instances of the clone we want (one "request bucket" for each node) and that if all other nodes fail, then the remaining node should hold all of them. Otherwise the requests would be simply discarded.
ro_ro: Nu are nici un sens să facem serviciile active în ambele locații dacă nu putem ajunge la acestea, așa că hai să clonăm adresa IP. Resursele clonate IPaddr2 folosesc o regulă de iptables pentru a se asigura că fiecare cerere nu este procesată decât de una din cele două instanțe ale clonei. Meta opțiunile adiționale spun clusterului câte instanțe ale clonei dorim (câte o "găleată de cereri" pentru fiecare nod) și că dacă toate celelalte noduri eșuează, atunci nodul care rămâne ar trebui să le țină pe toate. Altfel cererile ar fi pur și simplu aruncate.

source: Now we must tell the ClusterIP how to decide which requests are processed by which hosts. To do this we must specify the clusterip_hash parameter.
ro_ro: Acum trebuie să spunem ClusterIP-ului cum să decidă care cereri sunt procesate de care gazde. Pentru a realiza acest lucru trebuie să specificăm parametrul clusterip_hash.

source: Open the ClusterIP resource
ro_ro: Deschideți resursa ClusterIP

source: And add the following to the params line
ro_ro: Adăugați următoarele pe linia params

source: So that the complete definition looks like:
ro_ro: Astfel încât definiția completă să arate precum:

source: Here is the full transcript
ro_ro: Aici este transcrierea completă

source: Notice how any constraints that referenced ClusterIP have been updated to use WebIP instead. This is an additional benefit of using the crm shell.
ro_ro: Vedeți câte restricții care referențiau ClusterIP au fost actualizate pentru a folosi WebIP în schimb. Acesta este un beneficiu adițional al folosirii shell-ului crm.

source: Next we need to convert the filesystem and Apache resources into clones. Again, the shell will automatically update any relevant constraints.
ro_ro: În continuare trebuie să convertim resursele de sistem de fișiere și Apache în clone. Din nou, shell-ul va actualiza în mod automat orice restricții relevante.

source: The last step is to tell the cluster that it is now allowed to promote both instances to be Primary (aka. Master).
ro_ro: Ultimul pas este acela de a spune clusterului că acum îi este permis să promoveze ambele instanțe să fie Primare (Master).

source: Change master-max to 2
ro_ro: Schimbați master-max la 2

source: Testing Recovery
ro_ro: Testarea Recuperării

source: TODO: Put one node into standby to demonstrate failover
ro_ro: TODO: Plasarea unui nod în standby pentru a demonstra failover-ul
