Repository: ClusterLabs/Pacemaker
Catalog: doc/Clusters_from_Scratch/*/Ch-Intro.po
Languages: ro_ro

source: @@image: 'images/pcmk-overview.png'; md5=THIS FILE DOESN'T EXIST
ro_ro: @@image: 'images/pcmk-overview.png'; md5=ACEST FIȘIER NU EXISTĂ

source: @@image: 'images/pcmk-stack.png'; md5=THIS FILE DOESN'T EXIST
ro_ro: @@image: 'images/pcmk-stack.png'; md5=ACEST FIȘIER NU EXISTĂ

source: @@image: 'images/pcmk-internals.png'; md5=THIS FILE DOESN'T EXIST
ro_ro: @@image: 'images/pcmk-internals.png'; md5=ACEST FIȘIER NU EXISTĂ

source: @@image: 'images/pcmk-active-passive.png'; md5=THIS FILE DOESN'T EXIST
ro_ro: @@image: 'images/pcmk-active-passive.png'; md5=ACEST FIȘIER NU EXISTĂ

source: @@image: 'images/pcmk-active-active.png'; md5=THIS FILE DOESN'T EXIST
ro_ro: @@image: 'images/pcmk-active-active.png'; md5=ACEST FIȘIER NU EXISTĂ

source: Read-Me-First
ro_ro: Citeşte-mă-Întâi-pe-Mine

source: The Scope of this Document
ro_ro: Domeniul de Aplicare al acestui Document

source: Computer clusters can be used to provide highly available services or resources. The redundancy of multiple machines is used to guard against failures of many types.
ro_ro: Clusterele de calculatoare pot fi folosite pentru a furniza servicii sau resurse extrem de disponibile. Redundanța mai multor mașini este folosită pentru a proteja împotriva eșecurilor de multe feluri.

source: This document will walk through the installation and setup of simple clusters using the Fedora distribution, version 14. The clusters described here will use Pacemaker and Corosync to provide resource management and messaging. Required packages and modifications to their configuration files are described along with the use of the Pacemaker command line tool for generating the XML used for cluster control.
ro_ro: Acest document va trece prin instalarea și setarea de clustere simple folosind distribuția Fedora, versiunea 14. Clusterele descrise aici vor folosi Pacemaker și Corosync pentru a furniza gestiunea și mesageria resurselor. Pachetele necesare și modificările la fișierele de configurare ale acestora sunt descrise împreună cu folosirea utilitarului din linie de comandă al Pacemaker-ului pentru generarea XML-ului folosit pentru controlul clusterului.

source: Pacemaker is a central component and provides the resource management required in these systems. This management includes detecting and recovering from the failure of various nodes, resources and services under its control.
ro_ro: Pacemaker este o componentă centrală și furnizează gestiunea resurselor solicitate în aceste sisteme. Această gestiune include detectarea și recuperarea de la eșecul diverselor noduri, resurselor și serviciilor care sunt sub controlul acestuia.

source: When more in depth information is required and for real world usage, please refer to the <ulink url="http://www.clusterlabs.org/doc/">Pacemaker Explained</ulink> manual.
ro_ro: Când sunt necesare informații mai aprofundate și utilizarea în lumea reală, vă rugăm să faceți referință la manualul <ulink url="http://www.clusterlabs.org/doc/">Pacemaker Explained</ulink>.

source: What Is Pacemaker?
ro_ro: Ce Este Pacemaker?

source: Pacemaker is a cluster resource manager. It achieves maximum availability for your cluster services (aka. resources) by detecting and recovering from node and resource-level failures by making use of the messaging and membership capabilities provided by your preferred cluster infrastructure (either <ulink url="http://www.corosync.org/">Corosync</ulink> or Heartbeat).
ro_ro: Pacemaker este un gestionar de resurse de cluster. Atinge disponibilitatea maximă pentru serviciile voastre de cluster (resursele) prin detectarea şi recuperarea din eşecuri la nivel de nod sau de resursă prin folosirea capabilităţilor de mesagerie şi apartenenţă furnizate de infrastructura de cluster preferată (fie <ulink url="http://www.corosync.org/">Corosync</ulink> sau Heartbeat).

source: Pacemaker's key features include:
ro_ro: Caracteristicile cheie ale Pacemaker includ:

source: Detection and recovery of node and service-level failures
ro_ro: Detectarea şi recuperarea eşecurilor la nivel de nod şi serviciu

source: Storage agnostic, no requirement for shared storage
ro_ro: Agnostic d.p.d.v. al stocării, nu sunt cerinţe pentru spaţiu de stocare partajat

source: Resource agnostic, anything that can be scripted can be clustered
ro_ro: Agnostic d.p.d.v. al resurselor, orice poate fi scriptat poate fi folosit într-un cluster

source: Supports <ulink url="http://en.wikipedia.org/wiki/STONITH">STONITH</ulink> for ensuring data integrity
ro_ro: Suportă <ulink url="http://en.wikipedia.org/wiki/STONITH">STONITH</ulink> pentru asigurarea integrităţii datelor

source: Supports large and small clusters
ro_ro: Suportă clustere mici şi mari

source: Supports both <ulink url="http://en.wikipedia.org/wiki/Quorum_(Distributed_Systems)">quorate</ulink> and <ulink url="http://devresources.linux-foundation.org/dev/clusters/docs/ResourceDrivenClusters.pdf">resource driven</ulink> clusters
ro_ro: Suportă atât <ulink url="http://en.wikipedia.org/wiki/Quorum_(Distributed_Systems)">quorate</ulink> cât şi <ulink url="http://devresources.linux-foundation.org/dev/clusters/docs/ResourceDrivenClusters.pdf">clustere conduse de resurse</ulink>

source: Supports practically any <ulink url="http://en.wikipedia.org/wiki/High-availability_cluster#Node_configurations">redundancy configuration</ulink>
ro_ro: Suportă practic orice <ulink url="http://en.wikipedia.org/wiki/High-availability_cluster#Node_configurations">configuraţie redundantă</ulink>

source: Automatically replicated configuration that can be updated from any node
ro_ro: Configuraţie replicată în mod automat care poate fi actualizată de pe orice nod

source: Ability to specify cluster-wide service ordering, colocation and anti-colocation
ro_ro: Abilitatea de a specifica ordonare, colocare şi anti-colocare la nivelul întregului cluster

source: Clones: for services which need to be active on multiple nodes
ro_ro: Clone: pentru servicii care trebuie să fie active pe mai multe noduri

source: Multi-state: for services with multiple modes (eg. master/slave, primary/secondary)
ro_ro: Stări-multiple: pentru servicii cu mai multe moduri de operare (ex. master/slave, primar/secundar)

source: Support for advanced service types <placeholder-1/>
ro_ro: Suport pentru tipuri de servicii avansate <placeholder-1/>

source: Unified, scriptable, cluster shell
ro_ro: Shell de cluster unificat, scriptabil

source: Pacemaker Architecture
ro_ro: Arhitectura Pacemaker

source: At the highest level, the cluster is made up of three pieces:
ro_ro: La cel mai înalt nivel, clusterul este compus din trei părţi:

source: Non-cluster aware components (illustrated in green).
ro_ro: Componente fără apartenenţă la cluster (ilustrate în verde).

source: These pieces include the resources themselves, scripts that start, stop and monitor them, and also a local daemon that masks the differences between the different standards these scripts implement.
ro_ro: Aceste părți includ resursele în sine, scripturi care pornesc, opresc și le monitorizează și de asemenea un daemon local care maschează diferenţele între standardele diferite pe care aceste scripturi le implementează.

source: Resource management
ro_ro: Gestiunea resurselor

source: Pacemaker provides the brain (illustrated in blue) that processes and reacts to events regarding the cluster. These events include nodes joining or leaving the cluster; resource events caused by failures, maintenance, scheduled activities; and other administrative actions. Pacemaker will compute the ideal state of the cluster and plot a path to achieve it after any of these events. This may include moving resources, stopping nodes and even forcing them offline with remote power switches.
ro_ro: Pacemaker furnizează creierul (ilustrat în albastru) care procesează și reacționează la evenimente care privesc clusterul. Aceste evenimente includ noduri care se alătură sau pleacă din cluster, evenimente ale resurselor cauzate de eșecuri, mentenanță, activități programate; și alte acțiuni administrative. Pacemaker va calcula starea ideală a clusterului și va cartografia o cale de a atinge țelul după oricare din aceste evenimente. Acest lucru poate include mutarea de resurse, oprirea nodurilor sau chiar oprirea forțată a acestora cu switch-uri de curent cu acces de la distanță.

source: Low level infrastructure
ro_ro: Infrastructura la nivel inferior

source: Corosync provides reliable messaging, membership and quorum information about the cluster (illustrated in red).
ro_ro: Corosync furnizează informații de încredere de mesagerie, apartenență și quorum despre cluster (ilustrate cu roșu).

source: Conceptual Stack Overview
ro_ro: Vederea Conceptuală a Stivei

source: Conceptual overview of the cluster stack
ro_ro: Vederea conceptuală a stivei de cluster

source: Even though Pacemaker also supports Heartbeat, the filesystems need to use the stack for messaging and membership and Corosync seems to be what they're standardizing on. Technically it would be possible for them to support Heartbeat as well, however there seems little interest in this.
ro_ro: Deși Pacemaker suportă de asemenea și Heartbeat, sistemele de fișiere au nevoie să folosească stiva pentru mesagerie și apartenență și Corosync pare să fie ținta standardizării. Tehnic vorbind ar fi posibil ca acestea să suporte Heartbeat de asemenea, însă există puţin interes pentru acest aspect.

source: When combined with Corosync, Pacemaker also supports popular open source cluster filesystems <placeholder-1/> Due to recent standardization within the cluster filesystem community, they make use of a common distributed lock manager which makes use of Corosync for its messaging capabilities and Pacemaker for its membership (which nodes are up/down) and fencing services.
ro_ro: În combinaţie cu Corosync, Pacemaker suportă de asemenea sistemele de fişiere de cluster populare open source <placeholder-1/> Datorită standardizării recente dinăuntrul comunităţii de sisteme de fişiere de cluster, acestea folosesc un manager de blocare distribuit care foloseşte la rândul său Corosync pentru capabilităţile acestuia de mesagerie şi Pacemaker pentru apartenenţă (care noduri sunt funcţionale şi care nu) şi pentru servicii de evacuare forțată.

source: The Pacemaker Stack
ro_ro: Stiva Pacemaker

source: The Pacemaker stack when running on Corosync
ro_ro: Stiva Pacemaker atunci când rulează pe Corosync

source: Internal Components
ro_ro: Componente Interne

source: Pacemaker itself is composed of four key components (illustrated below in the same color scheme as the previous diagram):
ro_ro: Pacemaker însuşi este compus din patru componente cheie (ilustrate mai jos cu aceeaşi schemă de culori ca şi în diagrama anterioară):

source: CIB (aka. Cluster Information Base)
ro_ro: CIB (Cluster Information Base)

source: PEngine (aka. PE or Policy Engine)
ro_ro: PEngine (aka. PE sau Policy Engine)

source: Subsystems of a Pacemaker cluster running on Corosync
ro_ro: Subsisteme ale unui cluster Pacemaker rulând pe Corosync

source: The CIB uses XML to represent both the cluster's configuration and current state of all resources in the cluster. The contents of the CIB are automatically kept in sync across the entire cluster and are used by the PEngine to compute the ideal state of the cluster and how it should be achieved.
ro_ro: CIB-ul foloseşte XML pentru a reprezenta atât configuraţia clusterului cât şi starea curentă a tuturor resurselor din cluster. Conţinutul CIB-ului este ţinut sincronizat în mod automat pe tot clusterul şi este folosit de către PEngine pentru a calcula starea ideală a clusterului şi de a arăta cum poate fi atinsă.

source: This list of instructions is then fed to the DC (Designated Co-ordinator). Pacemaker centralizes all cluster decision making by electing one of the CRMd instances to act as a master. Should the elected CRMd process, or the node it is on, fail... a new one is quickly established.
ro_ro: Lista de instrucţiuni este apoi furnizată către DC (Designated Co-ordinator). Pacemaker centralizează toate deciziile clusterului prin alegerea uneia dintre instanţele de CRMd de a se comporta ca master. Dacă procesul ales de CRMd sau nodul pe care acesta există eşuează ... unul nou este stabilit repede.

source: The DC carries out the PEngine's instructions in the required order by passing them to either the LRMd (Local Resource Management daemon) or CRMd peers on other nodes via the cluster messaging infrastructure (which in turn passes them on to their LRMd process).
ro_ro: DC-ul îndeplineşte instrucţiunile PEngine-ului în ordinea necesară prin pasarea acestora fie către LRMd (Local Resource Managemen daemon) fie altor noduri pe care rulează CRMd prin infrastructura de mesagerie a clusterului (care la rândul ei le pasează către procesul lor LRMd).

source: The peer nodes all report the results of their operations back to the DC and based on the expected and actual results, will either execute any actions that needed to wait for the previous one to complete, or abort processing and ask the PEngine to recalculate the ideal cluster state based on the unexpected results.
ro_ro: Nodurile vecine raportează toate rezultatele operaţiunilor înapoi către DC şi pe baza rezultatelor aşteptate şi a rezultatelor actuale, fie va executa acţiuni care necesitau să aştepte ca şi cele anterioare să termine, sau va anula procesarea şi va ruga PEngine-ul să recalculeze starea ideală a clusterului pe baza rezultatelor neaşteptate.

source: In some cases, it may be necessary to power off nodes in order to protect shared data or complete resource recovery. For this Pacemaker comes with STONITHd. STONITH is an acronym for Shoot-The-Other-Node-In-The-Head and is usually implemented with a remote power switch. In Pacemaker, STONITH devices are modeled as resources (and configured in the CIB) to enable them to be easily monitored for failure, however STONITHd takes care of understanding the STONITH topology such that its clients simply request a node be fenced and it does the rest.
ro_ro: În anumite cazuri, ar putea fi necesar să oprească alimentarea nodurilor pentru a proteja datele partajate sau pentru a termina recuperarea de resurse. Pentru acest lucru Pacemaker vine cu STONITHd. STONITH este un acronim pentru Shoot-The-Other-Node-In-The-Head (împuşcă celălalt nod în cap) şi este implementat de obicei cu un switch de alimentare cu curent controlat de la distanţă. În Pacemaker, dispozitivele STONITH sunt modelate precum resursele (şi configurate în CIB) pentru a permite monitorizarea facilă a acestora în caz de eşec, totuşi STONITHd se ocupă de înţelegerea topologiei STONITH astfel încât clienţii acestuia să solicite pur şi simplu ca un nod să fie evacuat şi acesta se va ocupa de rest.

source: Types of Pacemaker Clusters
ro_ro: Tipuri de Clustere Pacemaker

source: Pacemaker makes no assumptions about your environment, this allows it to support practically any <ulink url="http://en.wikipedia.org/wiki/High-availability_cluster#Node_configurations">redundancy configuration</ulink> including Active/Active, Active/Passive, N+1, N+M, N-to-1 and N-to-N.
ro_ro: Pacemaker nu face nici un fel de presupuneri despre mediul vostru, acest aspect îi permite să suporte practic orice <ulink url="http://en.wikipedia.org/wiki/High-availability_cluster#Node_configurations">configuraţie redundantă</ulink> incluzând Activ/Activ, Activ/Pasiv, N+1, N+M, N-la-1 şi N-la-N.

source: In this document we will focus on the setup of a highly available Apache web server with an Active/Passive cluster using DRBD and Ext4 to store data. Then, we will upgrade this cluster to Active/Active using GFS2.
ro_ro: În acest document ne vom concentra pe setup-ul unui server web Apache extrem de disponibil cu un cluster Activ/Pasiv folosind DRBD și Ext4 pentru a stoca datele. Apoi, vom actualiza clusterul la Activ/Activ folosind GFS2.

source: Active/Passive Redundancy
ro_ro: Redundanţă Activă/Pasivă

source: Two-node Active/Passive clusters using Pacemaker and DRBD are a cost-effective solution for many High Availability situations.
ro_ro: Clusterele Active/Pasive formate din două noduri care folosesc Pacemaker şi DRBD sunt o soluţie eficientă d.p.d.v. al costului pentru multe situaţii de Disponibilitate Crescută.

source: N to N Redundancy
ro_ro: Redundanţă N la N

source: When shared storage is available, every node can potentially be used for failover. Pacemaker can even run multiple copies of services to spread out the workload.
ro_ro: Când un mediu de stocare partajat este disponibil, fiecare nod poate fi folosit în mod potenţial pentru failover. Pacemaker poate chiar rula mai multe copii ale serviciilor pentru a distribui sarcina de lucru.

source: translator-credits
ro_ro: genericul-traducătorului
