Repository: ClusterLabs/Pacemaker
Catalog: doc/Clusters_from_Scratch/*/Ch-Stonith.po
Languages: ro_ro

source: Configure STONITH
ro_ro: Configurarea STONITH

source: Why You Need STONITH
ro_ro: De Ce Aveți Nevoie de STONITH

source: <ulink url="http://en.wikipedia.org/wiki/STONITH">STONITH</ulink> is an acronym for Shoot-The-Other-Node-In-The-Head and it protects your data from being corrupted by rogue nodes or concurrent access.
ro_ro: <ulink url="http://en.wikipedia.org/wiki/STONITH">STONITH</ulink> este un acronim pentru Shoot-The-Other-Node-In-The-Head şi protejează datele voastre de la a fi corupte de către noduri pribege sau de la acces simultan.

source: Just because a node is unresponsive, this doesn't mean it isn't accessing your data. The only way to be 100% sure that your data is safe, is to use STONITH so we can be certain that the node is truly offline, before allowing the data to be accessed from another node.
ro_ro: Doar pentru că un nod nu mai răspunde, acest lucru nu înseamnă că acesta nu mai accesează datele voastre. Singura metodă de a fi 100% siguri că datele voastre sunt în siguranţă, este să folosiţi STONITH pentru a putea fi siguri că nodul este cu adevărat offline, înainte de a permite datelor să fie accesate de pe alt nod.

source: STONITH also has a role to play in the event that a clustered service cannot be stopped. In this case, the cluster uses STONITH to force the whole node offline, thereby making it safe to start the service elsewhere.
ro_ro: STONITH mai are un rol pe care îl joacă în cazul în care un serviciu de pe cluster nu poate fi oprit. În acest caz, clusterul foloseşte STONITH pentru a forţa întregul nod offline, astfel făcând să fie sigurâ pornirea serviciului în altă parte.

source: What STONITH Device Should You Use
ro_ro: Ce Dispozitiv STONITH Ar Trebui Să Folosiţi

source: It is crucial that the STONITH device can allow the cluster to differentiate between a node failure and a network one.
ro_ro: Este imperativ ca dispozitivul STONITH să permită clusterului să facă diferenţa între o defecţiune a nodului şi una a reţelei.

source: The biggest mistake people make in choosing a STONITH device is to use remote power switch (such as many on-board IMPI controllers) that shares power with the node it controls. In such cases, the cluster cannot be sure if the node is really offline, or active and suffering from a network fault.
ro_ro: Cea mai mare greşeală pe care o fac oamenii în alegerea unui dispozitiv STONITH este să folosească un switch de curent cu acces la distanţă (cum ar fi multe controlere IPMI integrate) care partajează curentul cu nodul pe care îl controlează. În astfel de cazuri, clusterul nu poate fi sigur dacă nodul este cu adevărat offline sau inactiv şi suferă din cauza unei probleme de reţea.

source: Likewise, any device that relies on the machine being active (such as SSH-based "devices" used during testing) are inappropriate.
ro_ro: În mod similar, orice dispozitiv care se bazează pe maşină să fie activă (cum ar fi "dispozitivele" bazate pe SSH folosite în timpul testării) sunt nepotrivite.

source: Configuring STONITH
ro_ro: Configurarea STONITH

source: Find the correct driver: <command>stonith_admin --list-installed</command>
ro_ro: Găsiţi driverul corect: <command>stonith_admin --list-installed</command>

source: Since every device is different, the parameters needed to configure it will vary. To find out the parameters associated with the device, run:
ro_ro: Din moment ce fiecare dispozitiv este diferit, parametrii necesari să îl configureze vor varia. Pentru a afla parametrii asociaţi dispozitivului, rulaţi:

source: The output should be XML formatted text containing additional parameter descriptions. We will endevor to make the output more friendly in a later version.
ro_ro: Rezultatul de ieşire ar trebui să fie un text formatat XML conţinând descrierile parametrilor adiţionali. Ne vom aventura să facem rezultatul de ieşire mai prietenos într-o versiune ulterioară.

source: Enter the shell <command>crm</command>
ro_ro: Intrați în shell-ul <command>crm</command>

source: Create an editable copy of the existing configuration <command>cib new stonith</command>
ro_ro: CreațI o copie editabilă a configurației existente <command>cib new stonith</command>

source: Create a fencing resource containing a primitive resource with a class of stonith, a type of <replaceable>type</replaceable> and a parameter for each of the values returned in step 2: <command>configure primitive ...</command>
ro_ro: Creați o resursă de evacuare forțată conținând o resursă primitivă cu o clasă stonith, de tipul <replaceable>type</replaceable> și un parametru pentru fiecare din valorile returnate la pasul 2: <command>configure primitive ...</command>

source: If the device does not know how to fence nodes based on their uname, you may also need to set the special <constant>pcmk_host_map</constant> parameter. See <command>man stonithd</command> for details.
ro_ro: Dacă dispozitivul nu știe cum să evacueze forțat nodurile pe baza uname-ului acestora, ar putea fi nevoie să setați parametrul special <constant>pcmk_host_map</constant> parameter. Vedeți <command>man stonithd</command> pentru detalii.

source: If the device does not support the <constant>list</constant> command, you may also need to set the special <constant>pcmk_host_list</constant> and/or <constant>pcmk_host_check</constant> parameters. See <command>man stonithd</command> for details.
ro_ro: Dacă dispozitivul nu suportă comanda <constant>list</constant> ar putea fi nevoie să setați parametrii speciali <constant>pcmk_host_list</constant> și/sau <constant>pcmk_host_check</constant>. Vedeți <command>man stonithd</command> pentru detalii.

source: If the device does not expect the victim to be specified with the <constant>port</constant> parameter, you may also need to set the special <constant>pcmk_host_argument</constant> parameter. See <command>man stonithd</command> for details.
ro_ro: Dacă dispozitivul nu se așteaptă ca victima să fie specificată cu parametrul <constant>port</constant> parameter, ar putea fi necesar să setați parametrul special <constant>pcmk_host_argument</constant>. Vedeți <command>man stonithd</command> pentru detalii.

source: Upload it into the CIB from the shell: <command>cib commit stonith</command>
ro_ro: Încărcați în CIB din shell: <command>cib commit stonith</command>

source: Once the stonith resource is running, you can test it by executing: <command>stonith_admin --reboot <replaceable>nodename</replaceable></command>. Although you might want to stop the cluster on that machine first.
ro_ro: Odată ce resursa stonith rulează, o puteți testa executând: <command>stonith_admin --reboot <replaceable>nodename</replaceable></command>. Deși ați putea dori să opriți clusterul pe acea mașină mai întâi.

source: Example
ro_ro: Exemplu

source: Assuming we have an chassis containing four nodes and an IPMI device active on 10.0.0.1, then we would chose the <literal>fence_ipmilan</literal> driver in step 2 and obtain the following list of parameters
ro_ro: Presupunând că avem un şasiu conţinând patru noduri şi un dispozitiv IPMI activ pe 10.0.0.1, atunci am alege driverul <literal>fence_ipmilan</literal> la pasul 2 şi am obţine următoarea listă de parametri

source: Obtaining a list of STONITH Parameters
ro_ro: Obţinerea unei liste de Parametri STONITH

source: from which we would create a STONITH resource fragment that might look like this
ro_ro: din care am crea un fragment de resursă STONITH care ar putea arăta aşa

source: Sample STONITH Resource
ro_ro: Exemplu de Resursă STONITH

source: And finally, since we disabled it earlier, we need to re-enable STONITH. At this point we should have the following configuration..
ro_ro: Și în sfârșit, din moment ce l-am dezactivat mai devreme, trebuie să reactivăm STONITH. În acest punct ar trebui să avem următoarea configurație.

source: translator-credits
ro_ro: genericul-traducătorului
